       01 CATEGORY-DETAILS.
           88 EOFCATEGORY                          VALUE HIGH-VALUES.
           05 CATEGORY-ID                          PIC 9(003).
           05 CATEGORY-NAME                        PIC X(030).
           05 CATEGORY-DESCRIPTION.
               10 CATEGORY-DESCRIPTION1            PIC X(050).
           05 CATEGORY-IS-ACTIVE                   PIC 9(001).
