       01  SR-CAT-REC.
           88  SC-EOF                      VALUE HIGH-VALUES.
           05  SR-SAND-CAT-ID.
               10  SR-SANDWICH-ID          PIC 9(003).
               10  SR-CATEGORY-ID          PIC 9(003).
