       01  SR-REC.
           88  SR-EOF                  VALUE HIGH-VALUES.
           05  SR-IID                  PIC 9(003).
           05  SR-EID                  PIC X(005).
           05  SR-S-DESCRIPTION        PIC X(025).
           05  SR-L-DESCRIPTION.
               10  SR-L-DESCRIPTION1   PIC X(025).
               10  SR-L-DESCRIPTION2   PIC X(025).
           05  SR-PRICE                PIC 99.
