       01 DEL-INGREDS-DETAILS.
       88 DEL-EOFINGREDS                       VALUE HIGH-VALUES.
           05 DEL-INGREDS-ID                   PIC 9(003).
           05 DEL-INGREDS-NAME                 PIC X(030).
           05 DEL-INGREDS-DESCRIPTION          PIC X(050).
           05 DEL-INGREDS-UNIT-SUPPLIER        PIC X(003).
           05 DEL-INGREDS-UNIT-SANDWICH        PIC X(003).
           05 DEL-TRESHOLD                     PIC 9(003).
           05 DEL-INGREDS-IS-ACTIVE            PIC 9(001).
