       01 DEL-CATEGORY-DETAILS.
       88 DEL-EOFCATEGORY                          VALUE HIGH-VALUES.
           05 DEL-CATEGORY-ID                          PIC 9(003).
           05 DEL-CATEGORY-NAME                        PIC X(030).
           05 DEL-CATEGORY-DESCRIPTION.
               10 DEL-CATEGORY-DESCRIPTION1            PIC X(050).
           05 DEL-CATEGORY-IS-ACTIVE                   PIC 9(001).
