           FD SANDWICHES.
           COPY "CB-FD-SR".

           FD CATEGORIES.
           COPY "CATEGORYFX".

           FD INGREDIENTS.
           COPY "FD-INGREDSFX".

           FD SR-ING.
           COPY "CB-FD-SR-ING".

           FD SR-CAT.
           COPY "CB-FD-SR-CAT".
