       01  INGREDS-DETAILS.
           88 EOFINGREDS                           VALUE HIGH-VALUES.
           05 INGREDS-ID                           PIC 9(003).
           05 INGREDS-NAME                         PIC X(030).
           05 INGREDS-DESCRIPTION                  PIC X(050).
           05 INGREDS-UNIT-SUPPLIER                PIC X(003).
           05 INGREDS-UNIT-SANDWICH                PIC X(003).
           05 TRESHOLD                             PIC 9(003).
           05 INGREDS-IS-ACTIVE                    PIC 9(001).
