       01  WSINGREDS-DETAILS.
           05 WSINGREDS-ID                         PIC 9(003).
           05 WSINGREDS-NAME                       PIC X(030).
           05 WSINGREDS-DESCRIPTION                PIC X(050).
           05 WSINGREDS-UNIT-SUPPLIER              PIC X(003).
           05 WSINGREDS-UNIT-SANDWICH              PIC X(003).
           05 WSTRESHOLD                           PIC 9(003).
           05 WSINGREDS-IS-ACTIVE                  PIC 9(001).
