       01 WS-RIS-DETAILS.
               05  WS-RIS-ID.
                   10 WS-RIS-ID-ING               PIC 9(003).
                   10 WS-RIS-ID-SUPP              PIC 9(003).
               05 WS-RIS-PRICE                    PIC 9(003).
               05 WS-RIS-DATE-VAL.
                   10 WS-RIS-YEAR                 PIC 9(004).
                   10 WS-RIS-MONTH                PIC 9(002).
                   10 WS-RIS-DAY                  PIC 9(002).
