       01 WSCATEGORY-DETAILS.
           05 WSCATEGORY-ID                          PIC 9(003).
           05 WSCATEGORY-NAME                        PIC X(030).
           05 WSCATEGORY-DESCRIPTION.
               10 WSCATEGORY-DESCRIPTION1            PIC X(050).
           05 WSCATEGORY-IS-ACTIVE                   PIC 9(001).
