       01  FDADMIN.
           88  STATUS-ADMIN         VALUE HIGH-VALUES.
           03  FDUSERNAME           PIC X(020).
           03  FDPASSWORD           PIC X(020).
