       01  FDLOG.
           03  FDLOG-DATE-TIME                     PIC X(029).
           03  FDLOG-PROGRAM                       PIC X(030).
           03  FDLOG-SECTION                       PIC X(017).
           03  FDLOG-DETAILS                       PIC X(122).
