       01  FDUNIDADE.
           88  STATUS-SIGLA-UNIDADE VALUE HIGH-VALUES.
           03  FDSIGLAUNIDADE       PIC X(005).
           03  FDNOMEUNIDADE        PIC X(030).
           03  FDDESCRICAO          PIC X(060).
           03  FDDATA-ATUAL.
             05  FDANO-ATUAL        PIC 9(004).
             05  FDMES-ATUAL        PIC 9(002).
             05  FDDIA-ATUAL        PIC 9(002).
