      ******************************************************************
      *    TRABALHO 18.02.2021 -> 23.02.2021 | PRCOB | DIOGO LIMA
      ******************************************************************
      *    É PRETENDIDO NESTE PROGRAMA FAZER A GESTÃO DE HORÁRIOS:
      *    REGISTANDO, CONSULTANDO, ALTERANDO E APAGANDO
      ******************************************************************
      *    PROGRAMA DEVE SER EXECUTADO COM UM LAYOUT DE JANELA DE
      *    LARGURA: 133 | ALTURA: 31 - SEM MOLDAR TEXTO AO REDIMENSIONAR
      ******************************************************************
      *    V5.0 | 23.02.2021
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GESTORHORARIOS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CLASS VALID-NAME  IS "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
                                "abcdefghijklmnopqrstuvwxyz"
                                "0123456789"
                                SPACE.
           CLASS VALID-PROF  IS "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
                                "abcdefghijklmnopqrstuvwxyz"
                                SPACE.
       CRT STATUS IS KEYSTATUS.
       REPOSITORY.
           FUNCTION TRIM INTRINSIC.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT HORARIOSFILE ASSIGN TO "horariosfich"
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS FDDATAAULA
              LOCK MODE MANUAL
              FILE STATUS FS-HORARIOS.

           SELECT UNIDADES ASSIGN TO "unidadesfich"
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS FDSIGLAUNIDADE
              FILE STATUS FS-UNIDADES.

           SELECT PROFS ASSIGN TO "profsfich"
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS FDSIGLAPROF
              FILE STATUS FS-PROFS.

           SELECT ADMINS ASSIGN TO "adminsfich"
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS FDADMIN
              FILE STATUS FS-ADMINS.

           SELECT LOGRECORDS ASSIGN TO "logrecords"
              ORGANIZATION IS LINE SEQUENTIAL
              ACCESS SEQUENTIAL
              FILE STATUS FS-LOGRECORDS.

       DATA DIVISION.
       FILE SECTION.
       FD  HORARIOSFILE.
       COPY FDHORARIOS.

       FD  UNIDADES.
       COPY FDUNIDADES.

       FD  PROFS.
       COPY FDPROFS.

       FD  ADMINS.
       COPY FDADMINS.

       FD  LOGRECORDS.
       COPY FDLOGRECORDS.

       WORKING-STORAGE SECTION.
       COPY WSHORARIOS.
       COPY WSADMINS.
       COPY WSLOGRECORDS.
       COPY VAR-VALIDDATE.
       COPY VAR-WEEKDAYS.
       COPY VAR-SPACEUPPER.

       01  ESCOLHA                  PIC 9(001).
           88  OPCAO-REGISTAR       VALUE 1.
           88  OPCAO-CONSULTAR      VALUE 2.
           88  OPCAO-ELIMINAR       VALUE 3.
           88  OPCAO-ALTERAR        VALUE 4.
           88  OPCAO-HELP           VALUE 5.
           88  VALID-ESCOLHA        VALUE 0 THRU 5.
       01  NOVA-ESCOLHA             PIC 9(001).
           88  OPCAO-SIM            VALUE 1.
           88  OPCAO-NAO            VALUE 2.
       01  CONS-AULADATA.
           03  CONS-ANO             PIC 9(004).
           03  CONS-MES             PIC 9(002).
           03  CONS-DIA             PIC 9(002).
       01  MENU-CONSULTA            PIC 9(001).
           88  DATAS-PASSADAS       VALUE 1.
           88  DATAS-FUTURAS        VALUE 2.
           88  DATAS-UNIDADES       VALUE 3.
           88  DATAS-DOCENTES       VALUE 4.
           88  VALID-MENU           VALUE 1 THRU 4.
       01  CONS-AULA-UNIDADE        PIC X(005).
       01  CONS-AULA-PROF           PIC A(004).
       01  ESCOLHA-ALTERAR          PIC 9(001).
           88  ALTERAR-UNIDADE      VALUE 1.
           88  ALTERAR-PROF         VALUE 2.
           88  ALTERAR-NOTA         VALUE 3.
           88  VALID-ALTERAR        VALUE 1 THRU 3.

       77  FS-HORARIOS              PIC X(002).
       77  FS-UNIDADES              PIC X(002).
       77  FS-PROFS                 PIC X(002).
       77  FS-ADMINS                PIC X(002).
       77  FS-LOGRECORDS            PIC X(002).
       77  SIGLASTRING              PIC X(005).
       77  LINHA                    PIC 9(004).
       77  COLUNA                   PIC 9(004).
       77  KEYSTATUS                PIC 9(004).
       77  COUNT-KEY                PIC 9.
       77  VERDADEIRO               PIC X.
       77  PRESS-KEY                PIC X.

      ******************************************************************

       SCREEN SECTION.

      ******************************************************************
      *    SCREEN DO MENU PRINCIPAL.

       01  MENU1-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 03 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 05 COL 50 VALUE "G E S T O R   D E   H O R A R I O S
      -        "".
           03  LINE 06 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 12 COL 61 VALUE "0. SAIR".
           03  LINE 14 COL 61 VALUE "1. REGISTAR".
           03  LINE 16 COL 61 VALUE "2. CONSULTAR".
           03  LINE 18 COL 61 VALUE "3. ELIMINAR".
           03  LINE 20 COL 61 VALUE "4. ALTERAR".
           03  LINE 22 COL 61 VALUE "5. AJUDA"
               HIGHLIGHT FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 48 VALUE "INSIRA A OPCAO QUE PRETENDE REALIZA
      -        "R:".
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  ESCOLHA-SCREEN LINE 29 COL 86 PIC 9(1) TO ESCOLHA AUTO
               BLANK WHEN ZERO.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO SEMPRE QUE O UTILIZADOR NÃO
      *    INTRODUZIR UMA OPÇÃO VÁLIDA.

       01  MENSAGEM-ERRO-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 20 VALUE "TEM DE INTRODUZIR UM DOS NUMEROS DE
      -        " OPCAO DISPONIVEIS | PRESSIONE QUALQUER TECLA PARA CONTI
      -        "NUAR" FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DO MENU HELP ONDE O UTILIZADOR PODE LER DICAS DO
      *    PROGRAMA.

       01  HELP-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 58 VALUE "I N T R O D U C A O".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 06 COL 10 VALUE "Nesta introducao encontram-se algum
      -        "as dicas rapidas para uma melhor utilizacao do programa.
      -        "" FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 08 COL 10 VALUE "Se precisar de uma explicacao mais
      -        "especifica, aconselhamos a consulta do manual de funcion
      -        "amento." FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 09 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 12 COL 63 VALUE "D I C A S" FOREGROUND-COLOUR 4
               BACKGROUND-COLOR 7.
           03  LINE 14 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 17 COL 10 VALUE "A qualquer momento podera sair do l
      -        "ocal onde navega pressionando F3, voltando ao menu princ
      -        "ipal.".
           03  LINE 19 COL 10 VALUE "Ao preencher o campo DATA, esta nao
      -        " deve ser inferior ao dia atual nem um domingo.".
           03  LINE 21 COL 10 VALUE "Ao preencher o campo da UNIDADE DE
      -        "FORMACAO e do DOCENTE, deve introduzir a sigla".
           03  LINE 23 COL 10 VALUE "correspondente a esses processos.".
           03  LINE 25 COL 10 VALUE "A saida forcada do programa, podera
      -        " originar a perda de dados. Devera seguir sempre o percu
      -        "rso logico do programa.".
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 48 VALUE "PRESSIONE QUALQUER TECLA PARA CONTI
      -        "NUAR".
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DO MENU REGISTAR E RESPETIVOS ACCEPT DAS VARIÁVEIS.

       01  REGISTAR-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 59 VALUE "R E G I S T A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 10 VALUE "PREENCHA OS SEGUINTES CAMPOS
      -        "       DO HORARIO:".
           03  LINE 06 COL 39 VALUE "OBRIGATORIOS"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.

           03  DATAAULA-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 10 COL 10 VALUE "DATA AULA:".
               05  REG-DIA LINE 10 COL 21 PIC X(2) TO WSDIA
                   REQUIRED AUTO.
               05  LINE 10 COL 23 VALUE "/".
               05  REG-MES LINE 10 COL 24 PIC X(2) TO WSMES
                   REQUIRED AUTO.
               05  LINE 10 COL 26 VALUE "/".
               05  REG-ANO LINE 10 COL 27 PIC X(4) TO WSANO
                   REQUIRED AUTO.
               05  LINE 27 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 29 COL 34 VALUE "DEVE INSERIR UMA DATA SUPERIOR
      -            "AO DIA ATUAL E QUE SEJA DIAS UTEIS"
                   HIGHLIGHT FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
               05  LINE 30 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.

           03  DIASEMANA-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 10 COL 40 VALUE "DIA DA SEMANA:".
               05  REG-DIASEMANA LINE 10 COL 55 PIC A(7) TO WSDIASEMANA
                   AUTO.

           03  UNIDADE-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 13 COL 10 VALUE "UNIDADE DE FORMACAO:".
               05  REG-UNIDADE LINE 13 COL 31 PIC X(5) TO WSUNIDADE
                   REQUIRED AUTO.
               05  LINE 27 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 29 COL 22 VALUE "NESTE CAMPO DEVERA INTRODUZIR A
      -            " SIGLA DA UNIDADE DE FORMACAO | PRESSIONE F1 PARA VE
      -            "R LISTA"
                   HIGHLIGHT FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
               05  LINE 30 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.

           03  PROF-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 16 COL 10 VALUE "DOCENTE:".
               05  REG-PROF LINE 16 COL 19 PIC A(4) TO WSPROF
                   REQUIRED AUTO.
               05  LINE 27 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 29 COL 28 VALUE "NESTE CAMPO DEVERA INTRODUZIR A
      -            " SIGLA DO DOCENTE | PRESSIONE F1 PARA VER LISTA"
                   HIGHLIGHT FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
               05  LINE 30 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.

           03  NOTA-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 19 COL 10 VALUE "NOTA           :".
               05  LINE 19 COL 15 VALUE "(opcional)"
                   HIGHLIGHT FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  REG-NOTA LINE 19 COL 27 PIC X(60) TO WSNOTA
                   AUTO.
               05  LINE 24 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 26 COL 28 VALUE "NESTE CAMPO PODERA INTRODUZIR Q
      -            "UALQUER INFORMACAO QUE QUEIRA ANEXAR AO REGISTO"
                   HIGHLIGHT FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
               05  LINE 27 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 29 COL 45 VALUE "SE PRETENDER NAO INTRODUZIR, PR
      -            "ESSIONE ENTER"
                   HIGHLIGHT FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
               05  LINE 30 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.

      ******************************************************************
      *    SCREEN DO DISPLAY DO DIA DA SEMANA.

       01  WEEK-DAYS-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  DOMINGO-SCREEN LINE 10 COL 55 PIC A(7) VALUE "DOMINGO".
           03  SEGUNDA-SCREEN LINE 10 COL 55 PIC A(7) VALUE "SEGUNDA".
           03  TERCA-SCREEN   LINE 10 COL 55 PIC A(7) VALUE "TERCA".
           03  QUARTA-SCREEN  LINE 10 COL 55 PIC A(7) VALUE "QUARTA".
           03  QUINTA-SCREEN  LINE 10 COL 55 PIC A(7) VALUE "QUINTA".
           03  SEXTA-SCREEN   LINE 10 COL 55 PIC A(7) VALUE "SEXTA".
           03  SABADO-SCREEN  LINE 10 COL 55 PIC A(7) VALUE "SABADO".

      ******************************************************************
      *    SCREEN DO DISPLAY DO NOME DA UNIDADE DE FORMAÇÃO.

       01  SHOW-UNIDADE-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 13 COL 37 VALUE "|".
           03  LINE 13 COL 39 PIC X(30) FROM FDNOMEUNIDADE.

      ******************************************************************
      *    SCREEN QUE LIMPA O NOME DA UNIDADE DE FORMAÇÃO.

       01  WIPE-SHOW-UNIDADE LINE 13 COL 37 PIC X(32) VALUE ALL SPACES
           BACKGROUND-COLOR 7.

      ******************************************************************
      *    SCREEN DO DISPLAY DO NOME DO DOCENTE.

       01  SHOW-PROF-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 16 COL 24 VALUE "|".
           03  LINE 16 COL 26 PIC X(50) FROM FDNOMEPROF.

      ******************************************************************
      *    SCREEN QUE LIMPA O NOME DO DOCENTE.

       01  WIPE-SHOW-PROF LINE 16 COL 24 PIC X(52) VALUE ALL SPACES
           BACKGROUND-COLOR 7.

      ******************************************************************
      *    SCREEN QUE OBTÉM DATA AUTOMÁTICA DA MÁQUINA.

       01  DATA-ATUAL-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 22 COL 10 VALUE "ULTIMA ATUALIZACAO:".
           03  REG-DIA-ATUAL LINE 22 COL 30 PIC 9(2) FROM WSDIA-ATUAL.
           03  LINE 22 COL 32 VALUE "/".
           03  REG-MES-ATUAL LINE 22 COL 33 PIC 9(2) FROM WSMES-ATUAL.
           03  LINE 22 COL 35 VALUE "/".
           03  REG-ANO-ATUAL LINE 22 COL 36 PIC 9(4) FROM WSANO-ATUAL.

      ******************************************************************
      *    SCREEN ONDE APARECE UMA LISTA COMPLETA COM TODOS OS REGISTOS
      *    DE UNIDADES DE FORMAÇÃO NO FICHEIRO.

       01  LISTA-UNIDADES-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 19 COL 112 VALUE "»" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 21 VALUE "É" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 21 VALUE "È" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 112 VALUE "¼" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 22 PIC X(45) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 19 COL 67 VALUE "Ë" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 68 PIC X(44) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 22 PIC X(45) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 67 VALUE "Ê" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 68 PIC X(44) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.

           03  LINE 18 COL 53 VALUE "LISTA UNIDADES DE FORMACAO".
           03  SHOW LINE LINHA COL COLUNA.
               05  SHOW-SIGLA-UNIDADE PIC X(5) FROM FDSIGLAUNIDADE.
               05  VALUE " - ".
               05  SHOW-NOME-UNIDADE PIC X(30) FROM FDNOMEUNIDADE.
           03  CONTINUA-LISTA1.
               05  REG-UNIDADE1 LINE 13 COL 31 PIC X(5) TO WSUNIDADE
                   REQUIRED AUTO.
               05  LINE 27 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 29 COL 37 VALUE "NESTE CAMPO DEVERA INTRODUZIR A
      -            " SIGLA DA UNIDADE DE FORMACAO"
                   HIGHLIGHT FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
               05  LINE 30 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.

      ******************************************************************
      *    SCREEN ONDE APARECE UMA LISTA COMPLETA COM TODOS OS REGISTOS
      *    DE DOCENTES NO FICHEIRO.

       01  LISTA-PROFS-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 19 COL 126 VALUE "»" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 07 VALUE "É" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 07 VALUE "È" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 126 VALUE "¼" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 08 PIC X(59) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 19 COL 67 VALUE "Ë" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 68 PIC X(58) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 08 PIC X(59) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 67 VALUE "Ê" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 68 PIC X(58) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.

           03  LINE 18 COL 54 VALUE "LISTA DE DOCENTES ATIVOS".
           03  SHOW LINE LINHA COL COLUNA.
               05  SHOW-SIGLA-PROF PIC A(4) FROM FDSIGLAPROF.
               05  VALUE " - ".
               05  SHOW-NOME-PROF PIC X(50) FROM FDNOMEPROF.
           03  CONTINUA-LISTA2.
               05  REG-PROF1 LINE 16 COL 19 PIC A(4) TO WSPROF
                   REQUIRED AUTO.
               05  LINE 27 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
               05  LINE 29 COL 43 VALUE "NESTE CAMPO DEVERA INTRODUZIR A
      -            " SIGLA DO DOCENTE"
                   HIGHLIGHT FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
               05  LINE 30 COL 01 PIC X(133) VALUE ALL "_"
                   FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.

      ******************************************************************
      *    SCREEN PARA LIMPAR PÁGINA DE LISTA E MOSTRAR PRÓXIMA.

       01  LIMPAR-LISTA1 FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 18 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 19 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 20 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 21 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 22 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 23 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 24 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 25 COL 01 PIC X(133) VALUE ALL SPACES.

      ******************************************************************
      *    SCREEN DE CONFIRMAÇÃO DE REGISTO REALIZADO.

       01  CONFIRMACAO-REGISTO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 34 VALUE "REGISTO FEITO COM SUCESSO | PRESSIO
      -        "NE QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 2 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM ERRO SE O UTILIZADOR REGISTAR UMA DATA QUE
      *    ESTEJA FORA DOS PARÂMETROS PREVIAMENTE DEFINIDOS NO PROGRAMA.

       01  DATA-INVALIDA FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 31 VALUE "DATA INVALIDA. INTRODUZA OUTRO | PR
      -        "ESSIONE QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO SE O UTILIZADOR TENTAR INTRODUZIR
      *    UMA DATA QUE JÁ EXISTA.

       01  DATA-EXISTENTE FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 31 VALUE "DATA EXISTENTE. INTRODUZA OUTRA | P
      -        "RESSIONE QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO SE O UTILIZADOR TENTAR INTRODUZIR
      *    UMA UNIDADE DE FORMACAO QUE NAO EXISTA.

       01  UNIDADE-INEXISTE FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 22 VALUE " UNIDADE DE FORMACAO NAO EXISTE. IN
      -        "TRODUZA OUTRA | PRESSIONE QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO SE O UTILIZADOR TENTAR INTRODUZIR
      *    UM DOCENTE QUE NAO EXISTA.

       01  PROF-INEXISTE FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 22 VALUE "  SIGLA DE DOCENTE NAO EXISTE. INTR
      -        "ODUZA OUTRA | PRESSIONE QUALQUER TECLA PARA CONTINUAR  "
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO SE O UTILIZADOR TENTAR INTRODUZIR
      *    UM DOCENTE QUE ESTEJA COM O ESTADO INATIVO.

       01  PROF-INATIVO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 22 VALUE "  DOCENTE ENCONTRA-SE INATIVO. INTR
      -        "ODUZA OUTRO | PRESSIONE QUALQUER TECLA PARA CONTINUAR  "
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO NA GRAVAÇÃO DO REGISTO DEVIDO AO
      *    ACESSO CONCORRENCIAL.

       01  ERRO-REGISTO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 59 VALUE "R E G I S T A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 13 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 15 COL 01 PIC X(133) VALUE ALL " ".
           03  LINE 16 COL 42 VALUE "OCORREU UM ERRO A GRAVAR O REGISTO
      -        "| TENTE NOVAMENTE"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 17 COL 01 PIC X(133) VALUE ALL " ".
           03  LINE 18 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM ONDE PERGUNTA AO UTILIZADOR, DADO O ERRO
      *    NA GRAVAÇÃO, SE PRETENDE TENTAR INSERIR UMA OUTRA DATA.

       01  REGISTO-NOVA-DATA FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 33 VALUE "PRETENDE TENTAR INTRODUZIR UMA DATA
      -        " DIFERENTE? 1 - SIM | 2 - NAO:".
           03  NOVA-DATA-ESCOLHA LINE 29 COL 99 PIC 9(1) TO
               NOVA-ESCOLHA AUTO BLANK WHEN ZERO.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM ONDE PERGUNTA AO UTILIZADOR SE PRETENDE
      *    FAZER UM NOVO REGISTO.

       01  NOVO-REGISTO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 42 VALUE "PRETENDE REGISTAR OUTRA DATA? 1 - S
      -        "IM | 2 - NAO:".
           03  NOVA-ESCOLHA-SCREEN LINE 29 COL 91 PIC 9(1) TO
               NOVA-ESCOLHA AUTO BLANK WHEN ZERO.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENU DE OPÇÕES DE CONSULTA.

       01  MENU-CONSULTA-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 58 VALUE "C O N S U L T A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 10 VALUE "INDIQUE DE QUE FORMA PRETENDE VER A
      -        " LISTA DE DATAS NO HORARIO:".
           03  LINE 07 COL 01 PIC X(133) VALUE ALL "_".
           03  MENU-CONS LINE 06 COL 73 PIC 9(1) TO MENU-CONSULTA AUTO.
           03  LINE 13 COL 46 VALUE "É" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 14 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 15 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 16 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 17 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 18 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 13 COL 47 PIC X(40) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 13 COL 87 VALUE "»" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 15 COL 54 VALUE "1 - POR DATAS PASSADAS".
           03  LINE 17 COL 54 VALUE "2 - POR DATAS FUTURAS".
           03  LINE 19 COL 54 VALUE "3 - POR UNIDADE DE FORMACAO".
           03  LINE 21 COL 54 VALUE "4 - POR DOCENTES".
           03  LINE 23 COL 46 VALUE "È" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 14 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 15 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 16 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 17 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 18 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 47 PIC X(40) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 23 COL 87 VALUE "¼" HIGHLIGHT FOREGROUND-COLOUR 0.

      ******************************************************************
      *    SCREEN DE MENSAGEM PARA INTRODUZIR UNIDADE DE FORMAÇÃO A
      *    A CONSULTAR O HORÁRIO.

       01  HORARIO-UNID-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 10 VALUE "INDIQUE A UNIDADE DE FORMACAO ONDE
      -        "PRETENDE VER AS DATAS NO HORARIO EXISTENTES:".
           03  MENU-CONS-AULA LINE 06 COL 90 PIC X(005) TO
               CONS-AULA-UNIDADE AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM PARA INTRODUZIR UNIDADE DE FORMAÇÃO A
      *    A CONSULTAR O HORÁRIO.

       01  HORARIO-PROF-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 10 VALUE "INDIQUE O DOCENTE ONDE PRETENDE VER
      -        " AS DATAS NO HORARIO EXISTENTES:".
           03  MENU-CONS-PROF LINE 06 COL 78 PIC A(004) TO
               CONS-AULA-PROF AUTO.

      ******************************************************************
      *    SCREEN DO MENU CONSULTAR.

       01  CONSULTAR-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 58 VALUE "C O N S U L T A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 10 VALUE "INDIQUE A DATA QUE PRETENDE CONSULT
      -        "AR:".
           03  LINE 07 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DOS DADOS DO REGISTO DO FICHEIRO.

       01  CONS-DADOS-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  C-HORARIO.
               05  C-DATAAULA.
                   07  C-ANO         LINE 10 COL 27 PIC 9(4).
                   07  C-MES         LINE 10 COL 24 PIC 9(2).
                   07  C-DIA         LINE 10 COL 21 PIC 9(2).
               05  C-DIASEMANA        LINE 10 COL 55 PIC A(7).
               05  C-UNIDADE          LINE 13 COL 31 PIC X(5).
               05  C-PROF             LINE 16 COL 19 PIC A(4).
               05  C-NOTA             LINE 19 COL 16 PIC X(60).
               05  C-DATA-ATUAL.
                   07  C-ANO-ATUAL    LINE 22 COL 36 PIC 9(4).
                   07  C-MES-ATUAL    LINE 22 COL 33 PIC 9(2).
                   07  C-DIA-ATUAL    LINE 22 COL 30 PIC 9(2).
           03  LINE 10 COL 10 VALUE "DATA AULA:".
           03  LINE 10 COL 23 VALUE "/".
           03  LINE 10 COL 26 VALUE "/".
           03  LINE 10 COL 40 VALUE "DIA DA SEMANA:".
           03  LINE 13 COL 10 VALUE "UNIDADE DE FORMACAO:".
           03  LINE 13 COL 37 VALUE "|".
           03  LINE 16 COL 10 VALUE "DOCENTE:".
           03  LINE 16 COL 24 VALUE "|".
           03  LINE 19 COL 10 VALUE "NOTA:".
           03  LINE 22 COL 10 VALUE "ULTIMA ATUALIZACAO:".
           03  LINE 22 COL 32 VALUE "/".
           03  LINE 22 COL 35 VALUE "/".

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO SE O UTILIZADOR TENTAR INTRODUZIR
      *    UMA DATA QUE NÃO EXISTE.

       01  REGISTO-INEXISTENTE FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 39 VALUE "DATA INEXISTENTE | PRESSIONE QUALQU
      -        "ER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ATENÇÃO QUANDO O REGISTO ESTÁ A SER
      *    UTILIZADO POR OUTRO UTILIZADOR.

       01  ATENCAO-REGISTO-LOCK FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 24 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 26 COL 42 VALUE "ATENCAO: REGISTO A SER USADO POR OU
      -        "TRO UTILIZADOR" FOREGROUND-COLOUR 4.

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ATENÇÃO QUANDO O REGISTO DE UNIDADES
      *    DE FORMAÇÃO OU DOCENTES ESTIVEREM A SER UTILIZADOS POR OUTRO
      *    UTILIZADOR.

       01  ATENCAO-REGISTO-LOCK1 FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 22 VALUE "ATENCAO: REGISTO A SER USADO POR OU
      -        "TRO UTILIZADOR | PRESSIONE QUALQUER TECLA PARA CONTINUAR
      -        "" FOREGROUND-COLOUR 4.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM ONDE PERGUNTA SE O UTILIZADOR PRETENDE
      *    FAZER UMA NOVA CONSULTA.

       01  NOVA-CONSULTA FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 42 VALUE "PRETENDE CONSULTAR OUTRA DATA? 1 -
      -        "SIM | 2 - NAO:".
           03  NOVA-ESCOLHA-SCREEN1 LINE 29 COL 92 PIC 9(1) TO
               NOVA-ESCOLHA AUTO BLANK WHEN ZERO.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE AUTENTICAÇÃO ATRAVÉS DE CREDENCIAIS.

       01  AUTENTICACAO-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 59 VALUE "E L I M I N A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 11 COL 46 VALUE "É" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 12 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 13 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 14 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 15 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 16 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 17 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 18 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 46 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 11 COL 47 PIC X(40) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 11 COL 87 VALUE "»" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 13 COL 63 VALUE "USERNAME".
           03  USER-SCREEN LINE 14 COL 57 PIC X(20) TO WSUSERNAME.
           03  LINE 17 COL 63 VALUE "PASSWORD".
           03  PASSWORD-SCREEN LINE 18 COL 57 PIC X(20) TO WSPASSWORD
               SECURE.
           03  LINE 20 COL 46 VALUE "È" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 12 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 13 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 14 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 15 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 16 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 17 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 18 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 87 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 47 PIC X(40) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 20 COL 87 VALUE "¼" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 42 VALUE "PARA ACEDER TEM SE AUTENTITICAR COM
      -        "O ADMINISTRADOR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO QUANDO A AUTENTICAÇÃO É NEGADA.

       01  AUTENTC-NEGADA-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 13 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 15 COL 01 PIC X(133) VALUE ALL " ".
           03  LINE 16 COL 37 VALUE "CREDENCIAIS NEGADAS | PRESSIONE QUA
      -        "LQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 17 COL 01 PIC X(133) VALUE ALL " ".
           03  LINE 18 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 27 COL 01 PIC X(133) VALUE ALL " ".
           03  LINE 29 COL 01 PIC X(133) VALUE ALL " ".
           03  LINE 30 COL 01 PIC X(133) VALUE ALL " ".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM QUANDO NENHUM ADMINISTRADOR ESTÁ CRIADO.

       01  ADMIN-INEXISTE-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 59 VALUE "E L I M I N A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 13 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 16 COL 24 VALUE "NENHUM ADMINISTRADOR CRIADO E PARA
      -        "ACEDER PRECISA SER AUTENTITICADO COMO ADMINISTRADOR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 18 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 48 VALUE "PRESSIONE QUALQUER TECLA PARA CONTI
      -        "NUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DO MENU ELIMINAR.

       01  ELIMINAR-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 59 VALUE "E L I M I N A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 10 VALUE "INDIQUE A DATA QUE PRETENDE ELIMINA
      -        "R:".
           03  LINE 07 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM ONDE PERGUNTA SE O UTILIZADOR PRETENDE
      *    MESMO ELIMINAR O PROCESSO.

       01  CONFIRMACAO-ELIMINAR FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 35 VALUE "TEM A CERTEZA QUE PRETENDE ELIMINAR
      -        " A DATA? 1 - SIM | 2 - NAO:".
           03  NOVA-ESCOLHA-SCREEN2 LINE 29 COL 98 PIC 9(1) TO
               NOVA-ESCOLHA AUTO BLANK WHEN ZERO.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM QUANDO O UTILIZADOR NÃO TEM A CERTEZA QUE
      *    QUER ELIMINAR O PROCESSO.

       01  NAO-ELIMINADO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 39 VALUE "OPERACAO ANULADA | PRESSIONE QUALQU
      -        "ER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM QUANDO O UTILIZADOR TEM A CERTEZA QUE QUER
      *    ELIMINAR O PROCESSO.

       01  SIM-ELIMINADO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 32 VALUE "DATA ELIMINADA COM SUCESSO | PRESSI
      -        "ONE QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 2 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM ONDE PERGUNTA SE O UTILIZDOR PRETENDE
      *    ELIMINAR OUTRO PROCESSO.

       01  NOVO-ELIMINAR FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 42 VALUE "PRETENDE ELIMINAR OUTRA DATA? 1 - S
      -        "IM | 2 - NAO:".
           03  NOVA-ESCOLHA-SCREEN3 LINE 29 COL 91 PIC 9(1) TO
               NOVA-ESCOLHA AUTO BLANK WHEN ZERO.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

******************************************************************
      *    SCREEN DE MENSAGEM DE ERRO QUANDO O UTILIZADOR TENTA ALTERAR
      *    OU ELIMINAR DATAS QUE JÁ PASSARAM.

       01  DATAS-PASSADAS-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 59 VALUE "E L I M I N A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 13 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 16 COL 24 VALUE "NAO PODE ELIMINAR NEM ALTERAR DATAS
      -        " PASSADAS | PRESSIONE QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 18 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DO MENU ALTERAR.

       01  ALTERAR-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 60 VALUE "A L T E R A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 10 VALUE "INDIQUE A DATA QUE PRETENDE MODIFIC
      -        "AR:".
           03  LINE 07 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM ONDE QUESTIONA QUE CAMPO PRETENDE ALTERAR.

       01  ALTERAR-CAMPO-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 24 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 26 COL 49 VALUE "INDIQUE O CAMPO QUE PRETENDE ALTERA
      -        "R:".
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  ESCOLHA-ALTERAR-SCREEN LINE 26 COL 87 PIC 9(1) TO
               ESCOLHA-ALTERAR AUTO BLANK WHEN ZERO.
           03  LINE 29 COL 44 VALUE "1. UNIDADE DE FORMACAO  |  2. DOCEN
      -        "TE  |  3. NOTA".
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM DE CONFIRMAÇÃO DE ALTERAÇÃO.

       01  CONFIRMACAO-ALTERACAO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 33 VALUE "DATA ALTERADA COM SUCESSO | PRESSIO
      -        "NE QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 2 BACKGROUND-COLOR 7.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEM QUESTIONA SE PRETENDE ALTERAR OUTRO CAMPO.

       01  NOVA-ALTERACAO FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 33 VALUE "PRETENDE ALTERAR MAIS ALGUM CAMPO D
      -        "ESTA DATA? 1 - SIM | 2 - NAO:".
           03  NOVA-ESCOLHA-SCREEN4 LINE 29 COL 98 PIC 9(1) TO
               NOVA-ESCOLHA AUTO BLANK WHEN ZERO.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN ONDE APARECE UMA LISTA COMPLETA COM TODOS OS REGISTOS
      *    NO FICHEIRO.

       01  LISTA-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 63 VALUE "HORARIO".
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  SHOW LINE LINHA COL COLUNA.
               05  SHOW-DIA PIC 9(2)     FROM FDDIA.
               05  VALUE "/".
               05  SHOW-MES PIC 9(2)     FROM FDMES.
               05  VALUE "/".
               05  SHOW-ANO PIC 9(4)     FROM FDANO.
               05  HIGHLIGHT FOREGROUND-COLOUR 0.
                  07  VALUE " - ".
                  07  SHOW-WEEKDAY PIC A(7) FROM FDDIASEMANA.
               05  VALUE "                  ".
               05  SHOW-UNIDADE PIC X(5) FROM FDDATAUNIDADE.
               05  VALUE "                          ".
               05  SHOW-PROF PIC A(4)    FROM FDDATAPROF.
           03  LINE 06 COL 51 VALUE "/".
           03  LINE 06 COL 54 VALUE "/".
           03  CONTINUA-LISTA.
               05  CONS-DIA-SCREEN LINE 06 COL 49 PIC X(2) TO
                   CONS-DIA AUTO.
               05  CONS-MES-SCREEN LINE 06 COL 52 PIC X(2) TO
                   CONS-MES AUTO.
               05  CONS-ANO-SCREEN LINE 06 COL 55 PIC X(4) TO
                   CONS-ANO AUTO.

           03  HIGHLIGHT FOREGROUND-COLOUR 0.
               05  LINE 11 COL 19 VALUE "É".
               05  LINE 11 COL 20 PIC X(30) VALUE ALL "Í".
               05  LINE 12 COL 33 VALUE "DATA".
               05  LINE 11 COL 50 VALUE "Ë".
               05  LINE 11 COL 51 PIC X(30) VALUE ALL "Í".
               05  LINE 12 COL 57 VALUE "UNIDADE DE FORMACAO".
               05  LINE 11 COL 81 VALUE "Ë".
               05  LINE 11 COL 82 PIC X(30) VALUE ALL "Í".
               05  LINE 12 COL 93 VALUE "DOCENTE".
               05  LINE 11 COL 112 VALUE "»".

               05  LINE 12 COL 19 VALUE "º".
               05  LINE 12 COL 50 VALUE "º".
               05  LINE 12 COL 81 VALUE "º".
               05  LINE 12 COL 112 VALUE "º".

               05  LINE 13 COL 19 VALUE "Ì".
               05  LINE 13 COL 20 PIC X(30) VALUE ALL "Í".
               05  LINE 13 COL 50 VALUE "Î".
               05  LINE 13 COL 51 PIC X(30) VALUE ALL "Í".
               05  LINE 13 COL 81 VALUE "Î".
               05  LINE 13 COL 82 PIC X(30) VALUE ALL "Í".
               05  LINE 13 COL 112 VALUE "¹".

               05  LINE 14 COL 19 VALUE "º".
               05  LINE 14 COL 50 VALUE "º".
               05  LINE 14 COL 81 VALUE "º".
               05  LINE 14 COL 112 VALUE "º".

               05  LINE 15 COL 19 VALUE "Ì".
               05  LINE 15 COL 20 PIC X(30) VALUE ALL "Í".
               05  LINE 15 COL 50 VALUE "Î".
               05  LINE 15 COL 51 PIC X(30) VALUE ALL "Í".
               05  LINE 15 COL 81 VALUE "Î".
               05  LINE 15 COL 82 PIC X(30) VALUE ALL "Í".
               05  LINE 15 COL 112 VALUE "¹".

               05  LINE 16 COL 19 VALUE "º".
               05  LINE 16 COL 50 VALUE "º".
               05  LINE 16 COL 81 VALUE "º".
               05  LINE 16 COL 112 VALUE "º".

               05  LINE 17 COL 19 VALUE "Ì".
               05  LINE 17 COL 20 PIC X(30) VALUE ALL "Í".
               05  LINE 17 COL 50 VALUE "Î".
               05  LINE 17 COL 51 PIC X(30) VALUE ALL "Í".
               05  LINE 17 COL 81 VALUE "Î".
               05  LINE 17 COL 82 PIC X(30) VALUE ALL "Í".
               05  LINE 17 COL 112 VALUE "¹".

               05  LINE 18 COL 19 VALUE "º".
               05  LINE 18 COL 50 VALUE "º".
               05  LINE 18 COL 81 VALUE "º".
               05  LINE 18 COL 112 VALUE "º".

               05  LINE 19 COL 19 VALUE "Ì".
               05  LINE 19 COL 20 PIC X(30) VALUE ALL "Í".
               05  LINE 19 COL 50 VALUE "Î".
               05  LINE 19 COL 51 PIC X(30) VALUE ALL "Í".
               05  LINE 19 COL 81 VALUE "Î".
               05  LINE 19 COL 82 PIC X(30) VALUE ALL "Í".
               05  LINE 19 COL 112 VALUE "¹".

               05  LINE 20 COL 19 VALUE "º".
               05  LINE 20 COL 50 VALUE "º".
               05  LINE 20 COL 81 VALUE "º".
               05  LINE 20 COL 112 VALUE "º".

               05  LINE 21 COL 19 VALUE "Ì".
               05  LINE 21 COL 20 PIC X(30) VALUE ALL "Í".
               05  LINE 21 COL 50 VALUE "Î".
               05  LINE 21 COL 51 PIC X(30) VALUE ALL "Í".
               05  LINE 21 COL 81 VALUE "Î".
               05  LINE 21 COL 82 PIC X(30) VALUE ALL "Í".
               05  LINE 21 COL 112 VALUE "¹".

               05  LINE 22 COL 19 VALUE "º".
               05  LINE 22 COL 50 VALUE "º".
               05  LINE 22 COL 81 VALUE "º".
               05  LINE 22 COL 112 VALUE "º".

               05  LINE 23 COL 19 VALUE "È".
               05  LINE 23 COL 20 PIC X(30) VALUE ALL "Í".
               05  LINE 23 COL 50 VALUE "Ê".
               05  LINE 23 COL 51 PIC X(30) VALUE ALL "Í".
               05  LINE 23 COL 81 VALUE "Ê".
               05  LINE 23 COL 82 PIC X(30) VALUE ALL "Í".
               05  LINE 23 COL 112 VALUE "¼".

      ******************************************************************
      *    SCREEN DE MENSAGEGM PARA VER OUTRA PÁGINA REGISTOS DA LISTA.

       01  MAIS-LISTA-SCREEN HIGHLIGHT FOREGROUND-COLOUR 0
           BACKGROUND-COLOR 7.
           03  LINE 26 COL 54 VALUE "PRESSIONE F2 PARA VER MAIS".

      ******************************************************************
      *    SCREEN DE MENSAGEGM QUANDO FIM DA LISTA.

       01  FIM-LISTA-SCREEN HIGHLIGHT FOREGROUND-COLOUR 0
           BACKGROUND-COLOR 7.
           03  LINE 26 COL 54 VALUE "       FIM DA LISTA       ".

      ******************************************************************
      *    SCREEN DE MENSAGEGM DE ERRO CASO O FICHEIRO ESTEJA VAZIO.

       01  LISTA-VAZIA-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 07 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 14 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 17 COL 35 VALUE "NAO EXISTE NENHUMA DATA | PRESSIONE
      -        " QUALQUER TECLA PARA CONTINUAR"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 19 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN DE MENSAGEGM ERRO CASO O FICHEIRO ESTEJA A SER USADO.

       01  ERRO-ACESSO-SCREEN FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 06 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 07 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 14 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 17 COL 35 VALUE "ERRO: REGISTO A SER USADO POR OUTRO
      -        " UTILIADOR | TENTE MAIS TARDE"
               FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 19 COL 01 PIC X(133) VALUE ALL "_".

      ******************************************************************
      *    SCREEN DE MENSAGEM ONDE DIZ QUE PARA REGISTAR UMA DATA É
      *    PRECISO TER PELO MENOS UM REGISTO DE UNIDADE DE FORMAÇÃO E
      *    DOCENTE.

       01  SEM-UNIDADE-PROF FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  BLANK SCREEN.
           03  LINE 01 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 03 COL 59 VALUE "R E G I S T A R".
           03  LINE 04 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR" HIGHLIGHT
               FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 14 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 17 COL 18 VALUE "PARA FAZER UM REGISTO DE HORARIO NE
      -        "CESSITA DE TER UMA UNIDADE DE FORMACAO E UM DOCENTE REGI
      -        "STADO" FOREGROUND-COLOUR 4 BACKGROUND-COLOR 7.
           03  LINE 19 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 27 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 29 COL 48 VALUE "PRESSIONE QUALQUER TECLA PARA CONTI
      -        "NUAR".
           03  LINE 30 COL 01 PIC X(133) VALUE ALL "_".
           03  LINE 01 COL 01 PIC X(1) TO PRESS-KEY AUTO.

      ******************************************************************
      *    SCREEN ONDE APARECE UMA LISTA COMPLETA COM TODOS OS REGISTOS
      *    DE UNIDADES DE FORMAÇÃO NO FICHEIRO.

       01  LISTA-UNIDADES-SCREEN1
           FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 19 COL 112 VALUE "»" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 21 VALUE "É" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 21 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 21 VALUE "È" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 112 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 112 VALUE "¼" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 22 PIC X(45) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 19 COL 67 VALUE "Ë" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 68 PIC X(44) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 22 PIC X(45) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 67 VALUE "Ê" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 68 PIC X(44) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.

           03  LINE 18 COL 53 VALUE "LISTA UNIDADES DE FORMACAO".
           03  SHOW LINE LINHA COL COLUNA.
               05  SHOW-SIGLA-UNIDADE PIC X(5) FROM FDSIGLAUNIDADE.
               05  VALUE " - ".
               05  SHOW-NOME-UNIDADE PIC X(30) FROM FDNOMEUNIDADE.

******************************************************************
      *    SCREEN ONDE APARECE UMA LISTA COMPLETA COM TODOS OS REGISTOS
      *    DE DOCENTES NO FICHEIRO.

       01  LISTA-PROFS-SCREEN1 FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 19 COL 126 VALUE "»" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 07 VALUE "É" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 07 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 07 VALUE "È" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 126 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 126 VALUE "¼" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 08 PIC X(59) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 19 COL 67 VALUE "Ë" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 20 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 21 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 22 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 23 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 24 COL 67 VALUE "º" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 19 COL 68 PIC X(58) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 08 PIC X(59) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.
           03  LINE 25 COL 67 VALUE "Ê" HIGHLIGHT FOREGROUND-COLOUR 0.
           03  LINE 25 COL 68 PIC X(58) VALUE ALL "Í" HIGHLIGHT
               FOREGROUND-COLOUR 0.

           03  LINE 18 COL 54 VALUE "LISTA DE DOCENTES ATIVOS".
           03  SHOW LINE LINHA COL COLUNA.
               05  SHOW-SIGLA-PROF PIC A(4) FROM FDSIGLAPROF.
               05  VALUE " - ".
               05  SHOW-NOME-PROF PIC X(50) FROM FDNOMEPROF.

      ******************************************************************
      *    SCREEN PARA LIMPAR PÁGINA DE LISTA E MOSTRAR PRÓXIMA.

       01  LIMPAR-LISTA FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 10 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 11 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 12 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 13 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 14 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 15 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 16 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 17 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 18 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 19 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 20 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 21 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 22 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 23 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 24 COL 01 PIC X(133) VALUE ALL SPACES.

      ******************************************************************
      *    SCREEN DE MENSAGEM PARA INFORMAR O UTILIZADOR PARA SAIR.

       01  F3-SAIR-SCREEN HIGHLIGHT FOREGROUND-COLOUR 0
           BACKGROUND-COLOR 7.
           03  LINE 31 COL 111 VALUE "PRESSIONE F3 PARA SAIR".

      ******************************************************************
      *    SCREEN PARA LIMPAR O ECRÃ EM DETERMINADAS LINHAS.

       01  LIMPAR-LINES FOREGROUND-COLOUR 0 BACKGROUND-COLOR 7.
           03  LINE 24 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 26 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 27 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 29 COL 01 PIC X(133) VALUE ALL SPACES.
           03  LINE 30 COL 01 PIC X(133) VALUE ALL SPACES.

      ******************************************************************

       PROCEDURE DIVISION.

       CREATE-OPEN-FILE SECTION.
      ******************************************************************
      *    VERIFICAÇÃO SE FICHEIRO EXISTE.
      ******************************************************************
           OPEN I-O HORARIOSFILE
           IF FS-HORARIOS = 35
              OPEN OUTPUT HORARIOSFILE
              CLOSE HORARIOSFILE
           ELSE
              CLOSE HORARIOSFILE
           END-IF

           MOVE "; GESTOR: HORARIOS" TO WSLOG-PROGRAM
           EXIT SECTION.

       MENU1 SECTION.
      ******************************************************************
      *    MENU PRINCIPAL ONDE O UTILIZADOR VAI ESCOLHER A OPÇÃO QUE
      *    PRETENDE REALIZAR.
      ******************************************************************
           MOVE ZEROS TO ESCOLHA-SCREEN
           PERFORM UNTIL ESCOLHA-SCREEN = 0

              PERFORM WITH TEST AFTER UNTIL VALID-ESCOLHA
                 MOVE ZEROS TO ESCOLHA-SCREEN
                 ACCEPT MENU1-SCREEN

                 IF NOT VALID-ESCOLHA THEN
                    ACCEPT MENSAGEM-ERRO-SCREEN
                 END-IF
              END-PERFORM

              EVALUATE TRUE
                 WHEN OPCAO-REGISTAR    PERFORM REGISTAR
                 WHEN OPCAO-CONSULTAR   PERFORM CONSULTAR
                 WHEN OPCAO-ELIMINAR    PERFORM ELIMINAR
                 WHEN OPCAO-ALTERAR     PERFORM ALTERAR
                 WHEN OPCAO-HELP        PERFORM HELP
              END-EVALUATE

           END-PERFORM
           EXIT PROGRAM.

       HELP SECTION.
      ******************************************************************
      *    MENU ONDE O UTILIZADOR PODE LER ALGUMAS DICAS E INSTRUÇÕES
      *    SOBRE O FUNCIONAMENTO DO PROGRAMA.
      ******************************************************************
           MOVE "; MENU: AJUDA" TO WSLOG-SECTION
           PERFORM SAVE-LOGRECORDS

           ACCEPT HELP-SCREEN
           EXIT SECTION.

       CHECK-UNIDADES-PROF-FILE SECTION.
      ******************************************************************
      *    MENU CHAMADO PELA SECÇÃO REGISTAR HORÁRIO ONDE VERIFICA SE OS
      *    FICHEIROS DE UNIDADES DE FORMAÇÃO E DE DOCENTES EXISTEM OU SE
      *    TÊM REGISTOS.
      ******************************************************************
           OPEN INPUT UNIDADES
              IF FS-UNIDADES = 35 THEN
                 ACCEPT SEM-UNIDADE-PROF
                 MOVE "S" TO VERDADEIRO
                 CLOSE UNIDADES
                 EXIT SECTION
              ELSE
                 MOVE LOW-VALUES TO FDSIGLAUNIDADE
                 START UNIDADES KEY IS GREATER OR EQUAL FDSIGLAUNIDADE
                    INVALID KEY
                       ACCEPT SEM-UNIDADE-PROF
                       MOVE "S" TO VERDADEIRO
                       CLOSE UNIDADES
                       EXIT SECTION
                 END-START
              END-IF
           CLOSE UNIDADES

           OPEN INPUT PROFS
              IF FS-PROFS = 35 THEN
                 ACCEPT SEM-UNIDADE-PROF
                 MOVE "S" TO VERDADEIRO
                 CLOSE PROFS
                 EXIT SECTION
              ELSE
                 MOVE "A" TO FDSIGLAPROF
                 START PROFS KEY IS GREATER OR EQUAL FDSIGLAPROF
                    INVALID KEY
                       ACCEPT SEM-UNIDADE-PROF
                       MOVE "S" TO VERDADEIRO
                       CLOSE PROFS
                       EXIT SECTION
                 END-START
              END-IF
           CLOSE PROFS
           EXIT SECTION.

       REGISTAR SECTION.
      ******************************************************************
      *    MENU REGISTAR ONDE O UTILIZADOR VAI INSERIR UMA NOVA DATA
      *    COM OS RESPETIVOS DADOS.
      ******************************************************************
           MOVE "; MENU: REGISTAR" TO WSLOG-SECTION

           MOVE SPACES TO VERDADEIRO
           PERFORM CHECK-UNIDADES-PROF-FILE
           IF VERDADEIRO = "S" THEN
              EXIT SECTION
           END-IF

           OPEN I-O HORARIOSFILE
           MOVE ZEROS TO NOVA-ESCOLHA-SCREEN
           PERFORM UNTIL NOVA-ESCOLHA-SCREEN = 2

              MOVE "DD"   TO REG-DIA
              MOVE "MM"   TO REG-MES
              MOVE "AAAA" TO REG-ANO
              MOVE SPACES TO REG-DIASEMANA, REG-UNIDADE,
                             REG-PROF, REG-NOTA

              DISPLAY REGISTAR-SCREEN
              DISPLAY LIMPAR-LINES

              PERFORM REGISTAR-DATA
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

              PERFORM REGISTAR-UNIDADE
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

              PERFORM REGISTAR-PROF
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

              PERFORM REGISTAR-NOTA
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

              PERFORM REGISTAR-DATA-ATUALIZACAO

              PERFORM GRAVAR-REG
                 IF KEYSTATUS = 1003 THEN
                    CLOSE UNIDADES
                    EXIT SECTION
                 END-IF

      *    AS LINHAS QUE SE SEGUEM SÃO INSTRUÇÕES CASO HAJA REGISTO
      *    DA MESMA KEY AO MESMO TEMPO ATRAVÉS DE ACESSO CONCORRENCIAL,
      *    DESTA FORMA É PERGUNTADO AO UTILIZADOR SE PRETENDE INTRODUZIR
      *    UMA NOVA KEY.

              IF VERDADEIRO = "Y" THEN
                 PERFORM WITH TEST AFTER UNTIL VERDADEIRO = "S"
                    MOVE SPACES TO VERDADEIRO

                    PERFORM WITH TEST AFTER UNTIL NOVA-ESCOLHA = 1 OR 2
                       MOVE ZEROS TO NOVA-DATA-ESCOLHA
                       ACCEPT REGISTO-NOVA-DATA
                       IF KEYSTATUS = 1003 THEN
                          CLOSE HORARIOSFILE
                          EXIT SECTION
                       END-IF

                       IF NOVA-ESCOLHA < 1 OR NOVA-ESCOLHA > 2 THEN
                          ACCEPT MENSAGEM-ERRO-SCREEN
                          IF KEYSTATUS = 1003 THEN
                             CLOSE HORARIOSFILE
                             EXIT SECTION
                          END-IF
                          DISPLAY LIMPAR-LINES
                       END-IF
                    END-PERFORM

                    EVALUATE NOVA-ESCOLHA
                       WHEN 1   DISPLAY REGISTAR-SCREEN
                                DISPLAY SHOW-UNIDADE-SCREEN
                                DISPLAY SHOW-PROF-SCREEN
                                PERFORM REGISTAR-DATA
                                   IF KEYSTATUS = 1003 THEN
                                      CLOSE HORARIOSFILE
                                      EXIT SECTION
                                   END-IF
                                PERFORM GRAVAR-REG
                                   IF KEYSTATUS = 1003 THEN
                                      CLOSE HORARIOSFILE
                                      EXIT SECTION
                                   END-IF

                       WHEN 2   CLOSE HORARIOSFILE
                                EXIT SECTION
                    END-EVALUATE
                 END-PERFORM
              END-IF

              PERFORM WITH TEST AFTER UNTIL NOVA-ESCOLHA = 1 OR 2
                 DISPLAY LIMPAR-LINES
                 MOVE ZEROS TO NOVA-ESCOLHA-SCREEN
                 ACCEPT NOVO-REGISTO
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

                 IF NOVA-ESCOLHA < 1 OR NOVA-ESCOLHA > 2 THEN
                    ACCEPT MENSAGEM-ERRO-SCREEN
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 END-IF
              END-PERFORM

           END-PERFORM
           CLOSE HORARIOSFILE
           EXIT SECTION.

       GRAVAR-REG SECTION.
      ******************************************************************
      *    SECÇÃO QUE É CHAMADA PARA GRAVAR O REGISTO.
      ******************************************************************
           CLOSE HORARIOSFILE
           OPEN I-O HORARIOSFILE

           READ HORARIOSFILE RECORD
              INVALID KEY
                 MOVE "; REGISTO: " TO WSLOG-ADD-HEADING
                 MOVE WSDATAAULA TO WSLOG-ADD-KEY
                 MOVE "; REGISTO COM SUCESSO" TO WSLOG-ADD-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 MOVE WSHORARIO TO FDHORARIO
                 WRITE FDHORARIO
                 END-WRITE
                 ACCEPT CONFIRMACAO-REGISTO
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF
                 MOVE "S" TO VERDADEIRO

              NOT INVALID KEY
                 DISPLAY ERRO-REGISTO
                 MOVE "Y" TO VERDADEIRO
           END-READ
           EXIT SECTION.

       REGISTAR-DATA SECTION.
      ******************************************************************
      *    REGISTO DA DATA FEITO PELO UTILIZADOR.
      ******************************************************************
           PERFORM WITH TEST AFTER UNTIL DATE-VALID = "Y" AND
           VERDADEIRO = "S" AND (WS-NUMBERDAY IS NOT = 1 AND
           WS-NUMBERDAY IS NOT = 7)
              MOVE SPACE TO DATE-VALID, VERDADEIRO
              MOVE "DD"   TO REG-DIA
              MOVE "MM"   TO REG-MES
              MOVE "AAAA" TO REG-ANO

              DISPLAY LIMPAR-LINES
              DISPLAY DATAAULA-SCREEN
              ACCEPT REG-DIA
              IF KEYSTATUS = 1003 THEN
                 EXIT SECTION
              END-IF
              ACCEPT REG-MES
              IF KEYSTATUS = 1003 THEN
                 EXIT SECTION
              END-IF
              ACCEPT REG-ANO
              IF KEYSTATUS = 1003 THEN
                 EXIT SECTION
              END-IF

      *    INSTRUÇÃO PARA VERIFICAR SE A DATA É VÁLIDA
              MOVE WSDATAAULA TO WS-VALID-DATE
              PERFORM CHECK-DATE
              MOVE WS-VALID-DATE TO WSDATAAULA

      *    INSTRUÇÃO PARA VERIFICAR SE A DATA É NUM DOMINGO
              MOVE WSDATAAULA TO WS-WEEK-DATE
              PERFORM CHECK-WEEK-DAY
              MOVE WS-WEEK-DATE TO WSDATAAULA

              IF DATE-VALID NOT = "Y" OR WS-NUMBERDAY = 1
              OR WS-NUMBERDAY = 7 THEN
                 ACCEPT DATA-INVALIDA
                 IF KEYSTATUS = 1003 THEN
                    EXIT SECTION
                 END-IF
              END-IF

              MOVE WSDATAAULA TO FDDATAAULA

              READ HORARIOSFILE RECORD
                 NOT INVALID KEY
                    DISPLAY LIMPAR-LINES
                    ACCEPT DATA-EXISTENTE
                    IF KEYSTATUS = 1003 THEN
                       EXIT SECTION
                    END-IF
                 INVALID KEY
                    MOVE "S" TO VERDADEIRO
              END-READ
           END-PERFORM

           PERFORM REGISTAR-DIASEMANA
              IF KEYSTATUS = 1003 THEN
                 CLOSE HORARIOSFILE
                 EXIT SECTION
              END-IF
           EXIT SECTION.

       REGISTAR-DIASEMANA SECTION.
      ******************************************************************
      *    REGISTO DO DIA DA SEMANA AUTOMATICAMENTE.
      ******************************************************************
           MOVE WSDATAAULA TO WS-WEEK-DATE
           PERFORM CHECK-WEEK-DAY
           MOVE WS-WEEK-DATE TO WSDATAAULA

           EVALUATE WS-NUMBERDAY
              WHEN 1   DISPLAY DOMINGO-SCREEN
                       MOVE DOMINGO-SCREEN TO WSDIASEMANA
              WHEN 2   DISPLAY SEGUNDA-SCREEN
                       MOVE SEGUNDA-SCREEN TO WSDIASEMANA
              WHEN 3   DISPLAY TERCA-SCREEN
                       MOVE TERCA-SCREEN   TO WSDIASEMANA
              WHEN 4   DISPLAY QUARTA-SCREEN
                       MOVE QUARTA-SCREEN  TO WSDIASEMANA
              WHEN 5   DISPLAY QUINTA-SCREEN
                       MOVE QUINTA-SCREEN  TO WSDIASEMANA
              WHEN 6   DISPLAY SEXTA-SCREEN
                       MOVE SEXTA-SCREEN   TO WSDIASEMANA
              WHEN 7   DISPLAY SABADO-SCREEN
                       MOVE SABADO-SCREEN  TO WSDIASEMANA
           END-EVALUATE
           EXIT SECTION.

       REGISTAR-UNIDADE SECTION.
      ******************************************************************
      *    REGISTO DA SIGLA E DO NOME DA UNIDADE DE FORMACAO NO HORARIO.
      ******************************************************************
           PERFORM WITH TEST AFTER UNTIL VERDADEIRO = "S"
              MOVE SPACES TO REG-UNIDADE, VERDADEIRO
              DISPLAY LIMPAR-LISTA1
              DISPLAY NOTA-SCREEN
              DISPLAY LIMPAR-LINES
              ACCEPT UNIDADE-SCREEN
              IF KEYSTATUS = 1001 THEN
                 PERFORM LISTA-UNIDADES
              END-IF
              IF KEYSTATUS = 1003 THEN
                 EXIT SECTION
              END-IF

      *    INSTRUÇÃO PARA RETIRAR ESPAÇOS E CONVERTER PARA MAIÚSCULAS.
           MOVE WSUNIDADE TO LINK-TEXT
           PERFORM SPACE-UPPER
           MOVE LINK-TEXT TO WSUNIDADE

              OPEN INPUT UNIDADES
                 MOVE WSUNIDADE TO FDSIGLAUNIDADE

                 READ UNIDADES RECORD
                    INVALID KEY
                       ACCEPT UNIDADE-INEXISTE
                       IF KEYSTATUS = 1003 THEN
                          CLOSE UNIDADES
                          EXIT SECTION
                       END-IF
                    NOT INVALID KEY
                       DISPLAY SHOW-UNIDADE-SCREEN
                       MOVE FDUNIDADE TO WSUNIDADE
                       MOVE "S" TO VERDADEIRO
                 END-READ

                 READ UNIDADES RECORD WITH LOCK
                 END-READ
                 COMMIT
                 IF FS-UNIDADES = "51" THEN
                    ACCEPT ATENCAO-REGISTO-LOCK1
                 END-IF

              CLOSE UNIDADES
           END-PERFORM
           EXIT SECTION.

       REGISTAR-PROF SECTION.
      ******************************************************************
      *    REGISTO DA SILA E NOME DO DOCENTE NO HORARIO.
      ******************************************************************
           PERFORM WITH TEST AFTER UNTIL VERDADEIRO = "S"
              MOVE SPACES TO REG-PROF, VERDADEIRO
              DISPLAY LIMPAR-LISTA1
              DISPLAY NOTA-SCREEN
              DISPLAY LIMPAR-LINES
              ACCEPT PROF-SCREEN
              IF KEYSTATUS = 1001 THEN
                 PERFORM LISTA-PROFS
              END-IF
              IF KEYSTATUS = 1003 THEN
                 EXIT SECTION
              END-IF

      *    INSTRUÇÃO PARA RETIRAR ESPAÇOS E CONVERTER PARA MAIÚSCULAS.
           MOVE WSPROF TO LINK-TEXT
           PERFORM SPACE-UPPER
           MOVE LINK-TEXT TO WSPROF

              OPEN INPUT PROFS
                 MOVE WSPROF TO FDSIGLAPROF

                 READ PROFS RECORD
                    INVALID KEY
                       ACCEPT PROF-INEXISTE
                       IF KEYSTATUS = 1003 THEN
                          CLOSE PROFS
                          EXIT SECTION
                       END-IF
                    NOT INVALID KEY
                       IF FDESTADO = "2" THEN
                          ACCEPT PROF-INATIVO
                       ELSE
                          DISPLAY SHOW-PROF-SCREEN
                          MOVE FDPROF TO WSPROF
                          MOVE "S" TO VERDADEIRO
                       END-IF
                 END-READ

                 IF VERDADEIRO = "S" THEN
                    READ PROFS RECORD WITH LOCK
                    END-READ
                    COMMIT
                    IF FS-PROFS = "51" THEN
                       ACCEPT ATENCAO-REGISTO-LOCK1
                    END-IF
                 END-IF

              CLOSE PROFS
           END-PERFORM
           EXIT SECTION.

       REGISTAR-NOTA SECTION.
      ******************************************************************
      *    REGISTO DE NOTA SOBRE A DATA PELO UTILIZADOR.
      ******************************************************************
           MOVE SPACES TO REG-NOTA
           DISPLAY LIMPAR-LISTA1
           DISPLAY LIMPAR-LINES
           ACCEPT NOTA-SCREEN
           IF KEYSTATUS = 1003 THEN
              EXIT SECTION
           END-IF

      *    INSTRUÇÃO PARA RETIRAR ESPAÇOS E CONVERTER PARA MAIÚSCULAS.
           MOVE WSNOTA TO LINK-TEXT
           PERFORM SPACE-UPPER
           MOVE LINK-TEXT TO WSNOTA

           IF WSNOTA IS EQUALS ALL SPACES THEN
              MOVE "(VAZIO)" TO WSNOTA
           END-IF

           DISPLAY LIMPAR-LINES
           EXIT SECTION.

       REGISTAR-DATA-ATUALIZACAO SECTION.
      ******************************************************************
      *    REGISTO AUTOMÁTICO DA ÚLTIMA ATUALIZAÇÃO DA DATA
      *    FEITO PELO UTILIZADOR.
      ******************************************************************
           ACCEPT WSDATA-ATUAL FROM DATE YYYYMMDD
           DISPLAY DATA-ATUAL-SCREEN
           EXIT SECTION.

       LISTA-HORARIO-PASSADAS SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA COM DATAS PASSADAS DE HORARIO.
      ******************************************************************
           MOVE SPACES TO VERDADEIRO
           MOVE "DD"   TO CONS-DIA-SCREEN
           MOVE "MM"   TO CONS-MES-SCREEN
           MOVE "YYYY" TO CONS-ANO-SCREEN
           MOVE LOW-VALUES TO FDDATAAULA

      *    INSTRUÇÃO PARA VERIFICAR SE A LISTA SE ENCONTRA VAZIA

           START HORARIOSFILE KEY IS GREATER OR EQUAL FDDATAAULA
              INVALID KEY
                 ACCEPT LISTA-VAZIA-SCREEN
                 MOVE "S" TO VERDADEIRO
                 EXIT SECTION
           END-START

           MOVE 14 TO LINHA
           MOVE 25 TO COLUNA
           PERFORM UNTIL STATUS-DATAAULA
              READ HORARIOSFILE NEXT RECORD
                 AT END SET STATUS-DATAAULA TO TRUE
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT CONTINUA-LISTA
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       EXIT SECTION
                    END-IF

                 NOT AT END
                 IF FUNCTION CURRENT-DATE (1:8) > FDDATAAULA THEN
                    DISPLAY LISTA-SCREEN
                    ADD 02 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 24) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT CONTINUA-LISTA
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA
                          MOVE 14 TO LINHA
                          MOVE 25 TO COLUNA
                       ELSE
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          EXIT SECTION
                       END-IF
                    END-IF
                 END-IF
              END-READ
           END-PERFORM
           EXIT SECTION.

       LISTA-HORARIO-FUTURO SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA DE HORARIOS FUTUROS.
      ******************************************************************
           MOVE SPACES TO VERDADEIRO
           MOVE "DD"   TO CONS-DIA-SCREEN
           MOVE "MM"   TO CONS-MES-SCREEN
           MOVE "YYYY" TO CONS-ANO-SCREEN
           MOVE FUNCTION CURRENT-DATE (1:8) TO FDDATAAULA

      *    INSTRUÇÃO PARA VERIFICAR SE A LISTA SE ENCONTRA VAZIA

           START HORARIOSFILE KEY IS GREATER OR EQUAL FDDATAAULA
              INVALID KEY
                 ACCEPT LISTA-VAZIA-SCREEN
                 MOVE "S" TO VERDADEIRO
                 EXIT SECTION
           END-START

           MOVE 14 TO LINHA
           MOVE 25 TO COLUNA
           PERFORM UNTIL STATUS-DATAAULA
              READ HORARIOSFILE NEXT RECORD
                 AT END SET STATUS-DATAAULA TO TRUE
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT CONTINUA-LISTA
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       EXIT SECTION
                    END-IF

                 NOT AT END
                    DISPLAY LISTA-SCREEN
                    ADD 02 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 24) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT CONTINUA-LISTA
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA
                          MOVE 14 TO LINHA
                          MOVE 25 TO COLUNA
                       ELSE
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          EXIT SECTION
                       END-IF
                    END-IF
              END-READ
           END-PERFORM
           EXIT SECTION.

       LISTA-HORARIO-UNIDADES SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA COM DATAS DE HORÁRIO DE UMA ESPECÍFICA
      *    UNIDADE DE FORMAÇÃO.
      ******************************************************************
           MOVE SPACES TO VERDADEIRO
           MOVE "DD"   TO CONS-DIA-SCREEN
           MOVE "MM"   TO CONS-MES-SCREEN
           MOVE "YYYY" TO CONS-ANO-SCREEN
           MOVE LOW-VALUES TO FDDATAAULA

      *    INSTRUÇÃO PARA VERIFICAR SE A LISTA SE ENCONTRA VAZIA

           START HORARIOSFILE KEY IS GREATER OR EQUAL FDDATAAULA
              INVALID KEY
                 ACCEPT LISTA-VAZIA-SCREEN
                 MOVE "S" TO VERDADEIRO
                 EXIT SECTION
           END-START

           MOVE 00 TO COUNT-KEY
           MOVE 14 TO LINHA
           MOVE 25 TO COLUNA
           PERFORM UNTIL STATUS-DATAAULA
              READ HORARIOSFILE NEXT RECORD
                 AT END SET STATUS-DATAAULA TO TRUE
                    IF COUNT-KEY = 00 THEN
                       ACCEPT LISTA-VAZIA-SCREEN
                       MOVE "S" TO VERDADEIRO
                       EXIT SECTION
                    END-IF
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT CONTINUA-LISTA
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       EXIT SECTION
                    END-IF

                 NOT AT END
                 IF CONS-AULA-UNIDADE = FDDATAUNIDADE THEN
                    DISPLAY LISTA-SCREEN
                    ADD 01 TO COUNT-KEY
                    ADD 02 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 24) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT CONTINUA-LISTA
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA
                          MOVE 14 TO LINHA
                          MOVE 25 TO COLUNA
                       ELSE
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          EXIT SECTION
                       END-IF
                    END-IF
                 END-IF
              END-READ
           END-PERFORM
           EXIT SECTION.

       LISTA-HORARIO-PROFS SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA COM DATAS DE HORÁRIO DE UM ESPECÍFICO
      *    DOCENTE.
      ******************************************************************
           MOVE SPACES TO VERDADEIRO
           MOVE "DD"   TO CONS-DIA-SCREEN
           MOVE "MM"   TO CONS-MES-SCREEN
           MOVE "YYYY" TO CONS-ANO-SCREEN
           MOVE LOW-VALUES TO FDDATAAULA

      *    INSTRUÇÃO PARA VERIFICAR SE A LISTA SE ENCONTRA VAZIA

           START HORARIOSFILE KEY IS GREATER OR EQUAL FDDATAAULA
              INVALID KEY
                 ACCEPT LISTA-VAZIA-SCREEN
                 MOVE "S" TO VERDADEIRO
                 EXIT SECTION
           END-START

           MOVE 00 TO COUNT-KEY
           MOVE 14 TO LINHA
           MOVE 25 TO COLUNA
           PERFORM UNTIL STATUS-DATAAULA
              READ HORARIOSFILE NEXT RECORD
                 AT END SET STATUS-DATAAULA TO TRUE
                    IF COUNT-KEY = 00 THEN
                       ACCEPT LISTA-VAZIA-SCREEN
                       MOVE "S" TO VERDADEIRO
                       EXIT SECTION
                    END-IF
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT CONTINUA-LISTA
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       EXIT SECTION
                    END-IF

                 NOT AT END
                 IF CONS-AULA-PROF = FDDATAPROF THEN
                    DISPLAY LISTA-SCREEN
                    ADD 01 TO COUNT-KEY
                    ADD 02 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 24) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT CONTINUA-LISTA
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA
                          MOVE 14 TO LINHA
                          MOVE 25 TO COLUNA
                       ELSE
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          EXIT SECTION
                       END-IF
                    END-IF
                 END-IF
              END-READ
           END-PERFORM
           EXIT SECTION.

       CONSULTAR SECTION.
      ******************************************************************
      *    MENU ONDE O UTILIZADOR PODE APENAS CONSULTAR DATA DO HORARIO.
      ******************************************************************
           MOVE "; MENU: CONSULTAR" TO WSLOG-SECTION

           OPEN INPUT HORARIOSFILE
           MOVE ZEROS TO NOVA-ESCOLHA-SCREEN1
           PERFORM UNTIL NOVA-ESCOLHA-SCREEN1 = 2

              PERFORM WITH TEST AFTER UNTIL VALID-MENU
                 MOVE ZEROS TO MENU-CONS
                 ACCEPT MENU-CONSULTA-SCREEN
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

                 IF NOT VALID-MENU THEN
                    ACCEPT MENSAGEM-ERRO-SCREEN
                 END-IF
              END-PERFORM

              EVALUATE TRUE
                 WHEN DATAS-PASSADAS
                    DISPLAY CONSULTAR-SCREEN
                    PERFORM LISTA-HORARIO-PASSADAS
                    IF KEYSTATUS = 1003 OR VERDADEIRO = "S" THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF

                 WHEN DATAS-FUTURAS
                    DISPLAY CONSULTAR-SCREEN
                    PERFORM LISTA-HORARIO-FUTURO
                    IF KEYSTATUS = 1003 OR VERDADEIRO = "S" THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF

                 WHEN DATAS-UNIDADES
                    DISPLAY LIMPAR-LISTA
                    PERFORM WITH TEST AFTER UNTIL VERDADEIRO NOT = "S"
                       MOVE SPACES TO MENU-CONS-AULA, VERDADEIRO
                       DISPLAY HORARIO-UNID-SCREEN
                       PERFORM LISTA-UNIDADES1
                       IF KEYSTATUS = 1003 THEN
                          CLOSE HORARIOSFILE
                          EXIT SECTION
                       END-IF
                       MOVE CONS-AULA-UNIDADE TO LINK-TEXT
                       PERFORM SPACE-UPPER
                       MOVE LINK-TEXT TO CONS-AULA-UNIDADE
                       OPEN INPUT UNIDADES
                          MOVE CONS-AULA-UNIDADE TO FDSIGLAUNIDADE
                          READ UNIDADES RECORD
                             INVALID KEY
                                ACCEPT UNIDADE-INEXISTE
                                IF KEYSTATUS = 1003 THEN
                                   CLOSE UNIDADES
                                   CLOSE HORARIOSFILE
                                   EXIT SECTION
                                END-IF
                                MOVE "S" TO VERDADEIRO
                                DISPLAY LIMPAR-LINES
                          END-READ
                    END-PERFORM
                    CLOSE UNIDADES
                    DISPLAY CONSULTAR-SCREEN
                    PERFORM LISTA-HORARIO-UNIDADES
                    IF KEYSTATUS = 1003 OR VERDADEIRO = "S" THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF

                 WHEN DATAS-DOCENTES
                    DISPLAY LIMPAR-LISTA
                    PERFORM WITH TEST AFTER UNTIL VERDADEIRO NOT = "S"
                       MOVE SPACES TO MENU-CONS-PROF, VERDADEIRO
                       DISPLAY HORARIO-PROF-SCREEN
                       PERFORM LISTA-PROFS1
                       IF KEYSTATUS = 1003 THEN
                          CLOSE HORARIOSFILE
                          EXIT SECTION
                       END-IF
                       MOVE CONS-AULA-PROF TO LINK-TEXT
                       PERFORM SPACE-UPPER
                       MOVE LINK-TEXT TO CONS-AULA-PROF
                       OPEN INPUT PROFS
                          MOVE CONS-AULA-PROF TO FDSIGLAPROF
                          READ PROFS RECORD
                             INVALID KEY
                                ACCEPT PROF-INEXISTE
                                IF KEYSTATUS = 1003 THEN
                                   CLOSE PROFS
                                   CLOSE HORARIOSFILE
                                   EXIT SECTION
                                END-IF
                                MOVE "S" TO VERDADEIRO
                                DISPLAY LIMPAR-LINES
                          END-READ
                    END-PERFORM
                    CLOSE PROFS
                    DISPLAY CONSULTAR-SCREEN
                    PERFORM LISTA-HORARIO-PROFS
                    IF KEYSTATUS = 1003 OR VERDADEIRO = "S" THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
              END-EVALUATE

              DISPLAY LIMPAR-LISTA
              DISPLAY LIMPAR-LINES

              IF VERDADEIRO NOT = "S" THEN
                 MOVE CONS-AULADATA TO FDDATAAULA

                 READ HORARIOSFILE RECORD INTO C-HORARIO
                    INVALID KEY
                       ACCEPT REGISTO-INEXISTENTE
                       IF KEYSTATUS = 1003 THEN
                          CLOSE HORARIOSFILE
                          EXIT SECTION
                       END-IF
                       DISPLAY LIMPAR-LINES
                    NOT INVALID KEY
                       MOVE "; REGISTO: " TO WSLOG-VIEW-HEADING
                       MOVE CONS-AULADATA TO WSLOG-VIEW-KEY
                       MOVE "; CONSULTA COM SUCESSO"
                       TO WSLOG-VIEW-MESSAGE
                       PERFORM SAVE-LOGRECORDS
                       DISPLAY CONS-DADOS-SCREEN
                       PERFORM GET-NOME-UNIDADE-PROF
                 END-READ

      *    INSTRUÇÕES PARA MOSTRAR O REGISTO SEM BLOQUEAR MAS VERIFICAR
      *    SE O REGISTO ESTÁ BLOQUEADO POR OUTRO UTILIADOR, MOSTRANDO NA
      *    MESMA OS DADOS E MENSAGEM DE ALERTA.

                 READ HORARIOSFILE RECORD WITH LOCK
                 END-READ
                 COMMIT
                 IF FS-HORARIOS = "51" THEN
                    DISPLAY ATENCAO-REGISTO-LOCK
                 END-IF
              END-IF

              PERFORM WITH TEST AFTER UNTIL NOVA-ESCOLHA = 1 OR 2
                 MOVE ZEROS TO NOVA-ESCOLHA-SCREEN1
                 ACCEPT NOVA-CONSULTA
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

                 IF NOVA-ESCOLHA < 1 OR NOVA-ESCOLHA > 2 THEN
                    ACCEPT MENSAGEM-ERRO-SCREEN
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 END-IF
              END-PERFORM

           END-PERFORM
           CLOSE HORARIOSFILE
           EXIT SECTION.

       GET-NOME-UNIDADE-PROF SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO PARA MOSTRAR O NOME DO DOCENTE E DA
      *    UNIDADE DE FORMAÇÃO, AO APRESENTAR OS DADOS DA DATA.
      ******************************************************************
           OPEN INPUT UNIDADES
              MOVE FDDATAUNIDADE TO FDSIGLAUNIDADE
              READ UNIDADES
                 NOT INVALID KEY
                    DISPLAY SHOW-UNIDADE-SCREEN
              END-READ
           CLOSE UNIDADES

           OPEN INPUT PROFS
              MOVE FDDATAPROF TO FDSIGLAPROF
              READ PROFS
                 NOT INVALID KEY
                    DISPLAY SHOW-PROF-SCREEN
              END-READ
           CLOSE PROFS
           EXIT SECTION.

       ADMIN-AUTENTICACAO SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO PARA AUTENTICAR O ADMINISTRADOR.
      ******************************************************************
           OPEN INPUT ADMINS
           IF FS-ADMINS = 35
              ACCEPT ADMIN-INEXISTE-SCREEN
              CLOSE ADMINS
              EXIT SECTION
           END-IF

           PERFORM WITH TEST AFTER UNTIL VERDADEIRO = "S"
              MOVE SPACES TO USER-SCREEN, PASSWORD-SCREEN, VERDADEIRO
              DISPLAY LIMPAR-LINES
              DISPLAY AUTENTICACAO-SCREEN

              ACCEPT USER-SCREEN
              IF KEYSTATUS = 1003 THEN
                 CLOSE ADMINS
                 EXIT SECTION
              END-IF

              ACCEPT PASSWORD-SCREEN
              IF KEYSTATUS = 1003 THEN
                 CLOSE ADMINS
                 EXIT SECTION
              END-IF

              MOVE WSADMIN TO FDADMIN
              READ ADMINS RECORD
                 INVALID KEY
                    MOVE "; ACESSO FOI NEGADO"
                    TO WSLOG-DELETE-DENIED-MESSAGE
                    MOVE "; USER: " TO WSLOG-USER-HEADING-DENIED
                    MOVE WSUSERNAME TO WSLOG-USER-DENIED
                    MOVE "; PASS: " TO WSLOG-PASS-HEADING-DENIED
                    MOVE WSPASSWORD TO WSLOG-PASS-DENIED
                    PERFORM SAVE-LOGRECORDS
                    DISPLAY LIMPAR-LISTA
                    ACCEPT AUTENTC-NEGADA-SCREEN
                    CLOSE ADMINS
                    EXIT SECTION
              END-READ

              MOVE "S" TO VERDADEIRO
           END-PERFORM
           CLOSE ADMINS
           EXIT SECTION.

       ELIMINAR SECTION.
      ******************************************************************
      *    MENU ONDE O UTILIZADOR PODE ELIMINAR QUALQUER DATA DO HORARIO
      ******************************************************************
           MOVE "; MENU: ELIMINAR" TO WSLOG-SECTION

           PERFORM ADMIN-AUTENTICACAO
           IF KEYSTATUS = 1003 OR VERDADEIRO NOT = "S" THEN
              EXIT SECTION
           END-IF

           OPEN I-O HORARIOSFILE
           MOVE ZEROS TO NOVA-ESCOLHA-SCREEN3
           PERFORM UNTIL NOVA-ESCOLHA-SCREEN3 = 2

              DISPLAY ELIMINAR-SCREEN

              PERFORM LISTA-HORARIO-FUTURO
              IF KEYSTATUS = 1003 OR VERDADEIRO = "S" THEN
                 CLOSE HORARIOSFILE
                 EXIT SECTION
              END-IF

              DISPLAY LIMPAR-LISTA
              DISPLAY LIMPAR-LINES

      *    INSTRUÇÕES PARA VERIFICAÇÃO SE UTILIZADOR TENTAR ALTERAR
      *    DATAS QUE JÁ PASSARAM

              IF CONS-AULADATA < FUNCTION CURRENT-DATE (1:8) THEN
                 MOVE "; REGISTO: " TO WSLOG-DELETE-HEADING
                 MOVE CONS-AULADATA TO WSLOG-DELETE-KEY
                 MOVE "; USER: " TO WSLOG-USER-HEADING
                 MOVE WSUSERNAME TO WSLOG-USER
                 MOVE "; TENTATIVA ELIMINICAO DATA PASSADA"
                 TO WSLOG-DELETE-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 ACCEPT DATAS-PASSADAS-SCREEN
                 CLOSE HORARIOSFILE
                 EXIT SECTION
             END-IF

              MOVE CONS-AULADATA TO FDDATAAULA

              READ HORARIOSFILE RECORD INTO C-HORARIO WITH LOCK
                 INVALID KEY
                    ACCEPT REGISTO-INEXISTENTE
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 NOT INVALID KEY
                    DISPLAY CONS-DADOS-SCREEN
                    PERFORM GET-NOME-UNIDADE-PROF
                    PERFORM CONFIRMAR-ELIMINAR
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
              END-READ

              IF FS-HORARIOS = "51" THEN
                 MOVE "; REGISTO: " TO WSLOG-VIEW-HEADING
                 MOVE CONS-AULADATA TO WSLOG-VIEW-KEY
                 MOVE "; REGISTO BLOQUEADO" TO WSLOG-VIEW-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 DISPLAY ERRO-ACESSO-SCREEN
              END-IF

              PERFORM WITH TEST AFTER UNTIL NOVA-ESCOLHA = 1 OR 2
                 MOVE ZEROS TO NOVA-ESCOLHA-SCREEN3
                 DISPLAY LIMPAR-LINES
                 ACCEPT NOVO-ELIMINAR
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

                 IF NOVA-ESCOLHA < 1 OR NOVA-ESCOLHA > 2 THEN
                    ACCEPT MENSAGEM-ERRO-SCREEN
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 END-IF
              END-PERFORM

           END-PERFORM
           CLOSE HORARIOSFILE
           EXIT SECTION.

       CONFIRMAR-ELIMINAR SECTION.
      ******************************************************************
      *    PERGUNTA DE CONFIRMAÇÃO DE ELIMINAÇÃO DA DATA.
      ******************************************************************
           PERFORM WITH TEST AFTER UNTIL NOVA-ESCOLHA = 1 OR 2
           MOVE ZEROS TO NOVA-ESCOLHA-SCREEN2
              ACCEPT CONFIRMACAO-ELIMINAR
              IF KEYSTATUS = 1003 THEN
                 MOVE "; REGISTO: " TO WSLOG-DELETE-HEADING
                 MOVE CONS-AULADATA TO WSLOG-DELETE-KEY
                 MOVE "; USER: " TO WSLOG-USER-HEADING
                 MOVE WSUSERNAME TO WSLOG-USER
                 MOVE "; ACESSO SEM CONCLUSAO" TO WSLOG-DELETE-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 EXIT SECTION
              END-IF

              IF NOVA-ESCOLHA < 1 OR NOVA-ESCOLHA > 2 THEN
                 ACCEPT MENSAGEM-ERRO-SCREEN
                 IF KEYSTATUS = 1003 THEN
                    EXIT SECTION
                 END-IF
                 DISPLAY LIMPAR-LINES
              END-IF
           END-PERFORM

           EVALUATE TRUE
              WHEN OPCAO-NAO
                 MOVE "; REGISTO: " TO WSLOG-DELETE-HEADING
                 MOVE CONS-AULADATA TO WSLOG-DELETE-KEY
                 MOVE "; USER: " TO WSLOG-USER-HEADING
                 MOVE WSUSERNAME TO WSLOG-USER
                 MOVE "; ACESSO SEM CONCLUSAO" TO WSLOG-DELETE-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 DISPLAY LIMPAR-LINES
                 COMMIT
                 ACCEPT NAO-ELIMINADO
                 IF KEYSTATUS = 1003 THEN
                    EXIT SECTION
                 END-IF
                 DISPLAY LIMPAR-LINES

              WHEN OPCAO-SIM
                 DELETE HORARIOSFILE RECORD
                 END-DELETE
                 MOVE "; REGISTO: " TO WSLOG-DELETE-HEADING
                 MOVE CONS-AULADATA TO WSLOG-DELETE-KEY
                 MOVE "; USER: " TO WSLOG-USER-HEADING
                 MOVE WSUSERNAME TO WSLOG-USER
                 MOVE "; ELIMINACAO COM SUCESSO" TO WSLOG-DELETE-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 DISPLAY LIMPAR-LINES
                 ACCEPT SIM-ELIMINADO
                 IF KEYSTATUS = 1003 THEN
                    EXIT SECTION
                 END-IF
                 DISPLAY LIMPAR-LINES
           END-EVALUATE
           EXIT SECTION.

       ALTERAR SECTION.
      ******************************************************************
      *    MENU ONDE O UTILIZADOR PODE ALTERAR QUALQUER CAMPO DO
      *    DE QUALQUER DATA DO HORARIO.
      ******************************************************************
           MOVE "; MENU: ALTERAR" TO WSLOG-SECTION

           OPEN I-O HORARIOSFILE
           MOVE ZEROS TO NOVA-ESCOLHA-SCREEN1
           PERFORM UNTIL NOVA-ESCOLHA-SCREEN1 = 2

              DISPLAY ALTERAR-SCREEN

              PERFORM LISTA-HORARIO-FUTURO
              IF KEYSTATUS = 1003 OR VERDADEIRO = "S" THEN
                 CLOSE HORARIOSFILE
                 EXIT SECTION
              END-IF

              DISPLAY LIMPAR-LISTA
              DISPLAY LIMPAR-LINES

      *    INSTRUÇÕES PARA VERIFICAÇÃO SE UTILIZADOR TENTAR ALTERAR
      *    DATAS QUE JÁ PASSARAM

              IF CONS-AULADATA < FUNCTION CURRENT-DATE (1:8) THEN
                 MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                 MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                 MOVE "; TENTATIVA ALTERACAO DATA PASSADA"
                 TO WSLOG-EDIT-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 ACCEPT DATAS-PASSADAS-SCREEN
                 CLOSE HORARIOSFILE
                 EXIT SECTION
             END-IF

              MOVE CONS-AULADATA TO FDDATAAULA

              READ HORARIOSFILE RECORD INTO C-HORARIO WITH LOCK
                 INVALID KEY
                    ACCEPT REGISTO-INEXISTENTE
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 NOT INVALID KEY
                    DISPLAY CONS-DADOS-SCREEN
                    PERFORM GET-NOME-UNIDADE-PROF
                    PERFORM ALTERAR-CAMPO
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
              END-READ

              IF FS-HORARIOS = "51" THEN
                 MOVE "; REGISTO: " TO WSLOG-VIEW-HEADING
                 MOVE CONS-AULADATA TO WSLOG-VIEW-KEY
                 MOVE "; REGISTO BLOQUEADO" TO WSLOG-VIEW-MESSAGE
                 PERFORM SAVE-LOGRECORDS
                 DISPLAY ERRO-ACESSO-SCREEN
              END-IF

              PERFORM WITH TEST AFTER UNTIL NOVA-ESCOLHA = 1 OR 2
                 DISPLAY LIMPAR-LINES
                 MOVE ZEROS TO NOVA-ESCOLHA-SCREEN1
                 COMMIT
                 ACCEPT NOVA-CONSULTA
                 IF KEYSTATUS = 1003 THEN
                    CLOSE HORARIOSFILE
                    EXIT SECTION
                 END-IF

                 IF NOVA-ESCOLHA < 1 OR NOVA-ESCOLHA > 2 THEN
                    ACCEPT MENSAGEM-ERRO-SCREEN
                    IF KEYSTATUS = 1003 THEN
                       CLOSE HORARIOSFILE
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 END-IF
              END-PERFORM

           END-PERFORM
           CLOSE HORARIOSFILE
           EXIT SECTION.

       ALTERAR-CAMPO SECTION.
      ******************************************************************
      *    MENU ONDE O UTILIZADOR ESCOLHE QUE CAMPO QUER ALTERAR.
      ******************************************************************
           MOVE C-HORARIO TO WSHORARIO

           MOVE ZEROS TO NOVA-ESCOLHA-SCREEN4
           PERFORM UNTIL NOVA-ESCOLHA-SCREEN4 = 2

              PERFORM WITH TEST AFTER UNTIL VALID-ALTERAR
                 MOVE ZEROS TO ESCOLHA-ALTERAR-SCREEN
                 DISPLAY LIMPAR-LINES
                 ACCEPT ALTERAR-CAMPO-SCREEN
                 IF KEYSTATUS = 1003 THEN
                    MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                    MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                    MOVE "; ACESSO SEM CONCLUSAO" TO WSLOG-EDIT-MESSAGE
                    MOVE SPACES TO WSLOG-EDIT-CAMPO
                    PERFORM SAVE-LOGRECORDS
                    EXIT SECTION
                 END-IF

                 IF NOT VALID-ALTERAR THEN
                    DISPLAY LIMPAR-LINES
                    ACCEPT MENSAGEM-ERRO-SCREEN
                    IF KEYSTATUS = 1003 THEN
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 END-IF
              END-PERFORM

              EVALUATE TRUE
                 WHEN ALTERAR-UNIDADE
                    MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                    MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                    MOVE "; UNIDADE DE FORMACAO ANTERIOR: "
                    TO WSLOG-EDIT-MESSAGE
                    MOVE WSUNIDADE TO WSLOG-EDIT-CAMPO
                    DISPLAY WIPE-SHOW-UNIDADE
                    PERFORM REGISTAR-UNIDADE
                    IF KEYSTATUS = 1003 THEN
                       MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                       MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                       MOVE "; ACESSO SEM CONCLUSAO"
                       TO WSLOG-EDIT-MESSAGE
                       MOVE SPACES TO WSLOG-EDIT-CAMPO
                       PERFORM SAVE-LOGRECORDS
                       EXIT SECTION
                    END-IF
                    PERFORM SAVE-LOGRECORDS

                 WHEN ALTERAR-PROF
                    MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                    MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                    MOVE "; DOCENTE ANTERIOR: " TO WSLOG-EDIT-MESSAGE
                    MOVE WSPROF TO WSLOG-EDIT-CAMPO
                    DISPLAY WIPE-SHOW-PROF
                    PERFORM REGISTAR-PROF
                    IF KEYSTATUS = 1003 THEN
                       MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                       MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                       MOVE "; ACESSO SEM CONCLUSAO"
                       TO WSLOG-EDIT-MESSAGE
                       MOVE SPACES TO WSLOG-EDIT-CAMPO
                       PERFORM SAVE-LOGRECORDS
                       EXIT SECTION
                    END-IF
                    PERFORM SAVE-LOGRECORDS

                 WHEN ALTERAR-NOTA
                    MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                    MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                    MOVE "; NOTA ANTERIOR: " TO WSLOG-EDIT-MESSAGE
                    MOVE WSNOTA TO WSLOG-EDIT-CAMPO
                    PERFORM REGISTAR-NOTA
                    IF KEYSTATUS = 1003 THEN
                       MOVE "; REGISTO: " TO WSLOG-EDIT-HEADING
                       MOVE CONS-AULADATA TO WSLOG-EDIT-KEY
                       MOVE "; ACESSO SEM CONCLUSAO"
                       TO WSLOG-EDIT-MESSAGE
                       MOVE SPACES TO WSLOG-EDIT-CAMPO
                       PERFORM SAVE-LOGRECORDS
                       EXIT SECTION
                    END-IF
                    PERFORM SAVE-LOGRECORDS
              END-EVALUATE

              PERFORM REGISTAR-DATA-ATUALIZACAO

              REWRITE FDHORARIO FROM WSHORARIO
              END-REWRITE

      *    INSTRUÇÃO PARA MANTER O REGISTO BLOQUEADO E DEPOIS PERGUNTAR
      *    SE UTILIZADOR PRETENDE ALTERAR MAIS ALGUM CAMPO DESSE REGISTO

              READ HORARIOSFILE RECORD WITH LOCK
              END-READ

              DISPLAY LIMPAR-LINES
              ACCEPT CONFIRMACAO-ALTERACAO
              IF KEYSTATUS = 1003 THEN
                 EXIT SECTION
              END-IF

              PERFORM WITH TEST AFTER UNTIL NOVA-ESCOLHA = 1 OR 2
                 DISPLAY LIMPAR-LINES
                 MOVE ZEROS TO NOVA-ESCOLHA-SCREEN4
                 ACCEPT NOVA-ALTERACAO
                 IF KEYSTATUS = 1003 THEN
                    EXIT SECTION
                 END-IF

                 IF NOVA-ESCOLHA < 1 OR NOVA-ESCOLHA > 2 THEN
                    ACCEPT MENSAGEM-ERRO-SCREEN
                    IF KEYSTATUS = 1003 THEN
                       EXIT SECTION
                    END-IF
                    DISPLAY LIMPAR-LINES
                 END-IF
              END-PERFORM

           END-PERFORM
           EXIT SECTION.

       LISTA-UNIDADES SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA COMPLETA DE UNIDADES DE FORMAÇÃO.
      ******************************************************************
           DISPLAY LIMPAR-LISTA1
           DISPLAY LIMPAR-LINES
           OPEN INPUT UNIDADES
           MOVE SPACES TO REG-UNIDADE1

           MOVE 20 TO LINHA
           MOVE 25 TO COLUNA
           PERFORM UNTIL STATUS-SIGLA-UNIDADE
              READ UNIDADES NEXT RECORD
                 AT END SET STATUS-SIGLA-UNIDADE TO TRUE
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT CONTINUA-LISTA1
                    CLOSE UNIDADES
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       CLOSE UNIDADES
                       EXIT SECTION
                    END-IF

                 NOT AT END
                    DISPLAY LISTA-UNIDADES-SCREEN
                    ADD 01 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA COLUNA.

                    IF (LINHA = 25 AND COLUNA = 25) THEN
                       MOVE 20 TO LINHA
                       MOVE 70 TO COLUNA
                    END-IF

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 25 AND COLUNA = 70) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT CONTINUA-LISTA1
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA1
                          MOVE 20 TO LINHA
                          MOVE 25 TO COLUNA
                       ELSE
                          CLOSE UNIDADES
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          CLOSE UNIDADES
                          EXIT SECTION
                       END-IF
                    END-IF
              END-READ
           END-PERFORM
           CLOSE UNIDADES
           EXIT SECTION.

       LISTA-UNIDADES1 SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA COMPLETA DE UNIDADES DE FORMAÇÃO.
      ******************************************************************
           DISPLAY LIMPAR-LISTA1
           DISPLAY LIMPAR-LINES
           OPEN INPUT UNIDADES
           MOVE SPACES TO MENU-CONS-AULA
           MOVE LOW-VALUES TO FDSIGLAUNIDADE

           START UNIDADES KEY IS GREATER OR EQUAL FDSIGLAUNIDADE
           END-START

           MOVE 20 TO LINHA
           MOVE 25 TO COLUNA
           PERFORM UNTIL STATUS-SIGLA-UNIDADE
              READ UNIDADES NEXT RECORD
                 AT END SET STATUS-SIGLA-UNIDADE TO TRUE
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT MENU-CONS-AULA
                    CLOSE UNIDADES
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       CLOSE UNIDADES
                       EXIT SECTION
                    END-IF

                 NOT AT END
                    DISPLAY LISTA-UNIDADES-SCREEN1
                    ADD 01 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA COLUNA.

                    IF (LINHA = 25 AND COLUNA = 25) THEN
                       MOVE 20 TO LINHA
                       MOVE 70 TO COLUNA
                    END-IF

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 25 AND COLUNA = 70) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT MENU-CONS-AULA
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA1
                          MOVE 20 TO LINHA
                          MOVE 25 TO COLUNA
                       ELSE
                          CLOSE UNIDADES
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          CLOSE UNIDADES
                          EXIT SECTION
                       END-IF
                    END-IF
              END-READ
           END-PERFORM
           CLOSE UNIDADES
           EXIT SECTION.

       LISTA-PROFS SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA COMPLETA DE DOCENTES.
      ******************************************************************
           DISPLAY LIMPAR-LISTA1
           DISPLAY LIMPAR-LINES
           OPEN INPUT PROFS
           MOVE SPACES TO REG-PROF1

           MOVE 20 TO LINHA
           MOVE 08 TO COLUNA
           PERFORM UNTIL STATUS-SIGLA-PROF
              READ PROFS NEXT RECORD
                 AT END SET STATUS-SIGLA-PROF TO TRUE
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT CONTINUA-LISTA2
                    CLOSE PROFS
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       CLOSE PROFS
                       EXIT SECTION
                    END-IF

                 NOT AT END
                 IF FDESTADO <> "2" THEN
                    DISPLAY LISTA-PROFS-SCREEN
                    ADD 01 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA COLUNA.

                    IF (LINHA = 25 AND COLUNA = 08) THEN
                       MOVE 20 TO LINHA
                       MOVE 68 TO COLUNA
                    END-IF

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 25 AND COLUNA = 68) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT CONTINUA-LISTA2
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA1
                          MOVE 20 TO LINHA
                          MOVE 08 TO COLUNA
                       ELSE
                          CLOSE PROFS
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          CLOSE PROFS
                          EXIT SECTION
                       END-IF
                    END-IF
                 END-IF
              END-READ
           END-PERFORM
           CLOSE PROFS
           EXIT SECTION.

       LISTA-PROFS1 SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO SEMPRE QUE OUTRO MENU NECESSITAR DE
      *    APRESENTAR A LISTA COMPLETA DE DOCENTES.
      ******************************************************************
           DISPLAY LIMPAR-LISTA1
           DISPLAY LIMPAR-LINES
           OPEN INPUT PROFS
           MOVE SPACES TO MENU-CONS-PROF
           MOVE "A" TO FDSIGLAPROF

           START PROFS KEY IS GREATER OR EQUAL FDSIGLAPROF
           END-START

           MOVE 20 TO LINHA
           MOVE 08 TO COLUNA
           PERFORM UNTIL STATUS-SIGLA-PROF
              READ PROFS NEXT RECORD
                 AT END SET STATUS-SIGLA-PROF TO TRUE
                    DISPLAY FIM-LISTA-SCREEN
                    ACCEPT MENU-CONS-PROF
                    CLOSE PROFS
                    EXIT SECTION
                    IF KEYSTATUS = 1003 THEN
                       CLOSE PROFS
                       EXIT SECTION
                    END-IF

                 NOT AT END
                 IF FDESTADO <> "2" THEN
                    DISPLAY LISTA-PROFS-SCREEN1
                    ADD 01 TO LINHA

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA COLUNA.

                    IF (LINHA = 25 AND COLUNA = 08) THEN
                       MOVE 20 TO LINHA
                       MOVE 68 TO COLUNA
                    END-IF

      *    INSTRUÇÃO PARA MOSTRAR LISTA NOUTRA PÁGINA.

                    IF (LINHA = 25 AND COLUNA = 68) THEN
                       DISPLAY MAIS-LISTA-SCREEN
                       ACCEPT MENU-CONS-PROF
                       IF KEYSTATUS = 1002 THEN
                          DISPLAY LIMPAR-LISTA1
                          MOVE 20 TO LINHA
                          MOVE 08 TO COLUNA
                       ELSE
                          CLOSE PROFS
                          EXIT SECTION
                       END-IF
                       IF KEYSTATUS = 1003 THEN
                          CLOSE PROFS
                          EXIT SECTION
                       END-IF
                    END-IF
                 END-IF
              END-READ
           END-PERFORM
           CLOSE PROFS
           EXIT SECTION.

       SAVE-LOGRECORDS SECTION.
      ******************************************************************
      *    SECÇÃO QUE É CHAMADA PARA O FAZER O REGISTO NO FICHEIRO DE
      *    LOG, ONDE REGISTA TODA A MOVIMENTAÇÃO DENTRO DO PROGRAMA.
      ******************************************************************
           OPEN EXTEND LOGRECORDS
              STRING "DATA: ", FUNCTION CURRENT-DATE (1:4), "/",
                     FUNCTION CURRENT-DATE (5:2), "/",
                     FUNCTION CURRENT-DATE (7:2), "; HORA: ",
                     FUNCTION CURRENT-DATE (9:2), ":",
                     FUNCTION CURRENT-DATE (11:2) INTO WSLOG-DATE-TIME
              WRITE FDLOG FROM WSLOG
              END-WRITE
           CLOSE LOGRECORDS
           MOVE SPACES TO WSLOG-DETAILS
           EXIT SECTION.

       SPACE-UPPER SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO PARA RETIRAR ESPAÇOS EXTRA NO QUE O
      *    UTILIZADOR INTRODUZIR E CONVERTER PARA MAIÚSCULAS.
      ******************************************************************
           MOVE SPACES TO SPACE-CHECK1,
              SPACE-CHECK2, SPACE-CHECK3, SPACE-CHECK4, SPACE-CHECK5,
              SPACE-CHECK6, SPACE-CHECK7, SPACE-CHECK8, SPACE-CHECK9,
              SPACE-CHECK10, SPACE-CHECK11, SPACE-CHECK12,
              SPACE-CHECK13, SPACE-CHECK14, SPACE-CHECK15, SPACE-CHECK16
              SPACE-CHECK17, SPACE-CHECK18, SPACE-CHECK19, SPACE-CHECK20
              SPACE-CHECK21, SPACE-CHECK22, SPACE-CHECK23, SPACE-CHECK24

           MOVE FUNCTION TRIM (LINK-TEXT) TO LINK-TEXT

           MOVE FUNCTION UPPER-CASE (LINK-TEXT) TO LINK-TEXT

           UNSTRING LINK-TEXT DELIMITED BY ALL SPACES INTO SPACE-CHECK1,
              SPACE-CHECK2, SPACE-CHECK3, SPACE-CHECK4, SPACE-CHECK5,
              SPACE-CHECK6, SPACE-CHECK7, SPACE-CHECK8, SPACE-CHECK9,
              SPACE-CHECK10, SPACE-CHECK11, SPACE-CHECK12,
              SPACE-CHECK13, SPACE-CHECK14, SPACE-CHECK15, SPACE-CHECK16
              SPACE-CHECK17, SPACE-CHECK18, SPACE-CHECK19, SPACE-CHECK20
              SPACE-CHECK21, SPACE-CHECK22, SPACE-CHECK23, SPACE-CHECK24

           STRING
              SPACE-CHECK1  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK2  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK3  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK4  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK5  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK6  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK7  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK8  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK9  DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK10 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK11 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK12 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK13 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK14 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK15 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK16 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK17 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK18 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK19 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK20 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK21 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK22 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK23 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              SPACE-CHECK24 DELIMITED BY SPACES SPACE DELIMITED BY SIZE
              INTO LINK-TEXT
           EXIT SECTION.

       CHECK-DATE SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO PARA VERIFICAR SE A DATA INTRODUZIDA É UMA
      *    DATA VÁLIDA.
      ******************************************************************
           ACCEPT WS-CURRENT-DATE FROM DATE YYYYMMDD
           IF WS-CURRENT-DATE <= WS-VALID-DATE THEN
              IF VALID-YEAR AND VALID-MONTH AND VALID-DAY THEN
                   IF NOT MONTH-FEB AND NOT MONTH-30 THEN
                      MOVE "Y" TO DATE-VALID
                   ELSE
                    IF MONTH-30 AND DAY-30 THEN
                       MOVE "Y" TO DATE-VALID
                    END-IF
                    IF MONTH-FEB THEN
                       PERFORM LEAP-YEAR-CHECK
                       IF LEAP-YEAR-YES AND FEB-LEAP-YEAR THEN
                          MOVE "Y" TO DATE-VALID
                       ELSE
                          IF NOT LEAP-YEAR-YES AND DAY-FEBRUARY THEN
                             MOVE "Y" TO DATE-VALID
                          END-IF
                       END-IF
                    END-IF
                 END-IF
              END-IF
           END-IF
           EXIT SECTION.

       LEAP-YEAR-CHECK SECTION.
      ******************************************************************
      *    MENU QUE É CHAMADO PELO MÓDULO DA VERIFICAÇÃO DA DATA PARA
      *    VERIFICAR SE O ANO É BISSEXTO OU NÃO.
      ******************************************************************
           MOVE SPACE TO LEAP-YEAR
           IF FUNCTION MOD (WS-YEAR,4) = 0 THEN
              IF FUNCTION MOD (WS-YEAR,100) <> 0 THEN
                 MOVE "Y" TO LEAP-YEAR
              ELSE
                 IF FUNCTION MOD (WS-YEAR,400) = 0 THEN
                    MOVE "Y" TO LEAP-YEAR
                 END-IF
               END-IF
           END-IF
           EXIT SECTION.

       CHECK-WEEK-DAY SECTION.
      *****************************************************************
      *    MENU QUE É CHAMADO PARA VERIFICAR QUE DIA DA SEMANA
      *    CORRESPONDE A DATA INTRODUZIDA.
      ******************************************************************
           COMPUTE WS-NUMBERDAY =
           (FUNCTION MOD(FUNCTION INTEGER-OF-DATE(WS-WEEK-DATE) 7)) + 1
           END-COMPUTE
           EXIT SECTION.

       END PROGRAM GESTORHORARIOS.
