      *VARIÁVEIS USADAS PARA FAZER O REGISTO DO DIA DA SEMANA.
       01  WS-WEEK-DAYS  PIC X(21) VALUE "SUNMONTUEWEDTHUFRISAT".
       01  WS-WEEK-DAY   REDEFINES WS-WEEK-DAYS PIC X(3) OCCURS 7 TIMES.
       01  WS-WEEK-DATE  PIC 9(8) VALUE 0.
       01  WS-NUMBERDAY  PIC 9(1) VALUE 0.
