       01  WSUNIDADE.
           03  SIGLA                PIC X(005).
           03  NOME                 PIC X(030).
           03  DESCRICAO            PIC X(060).
           03  DATA-ATUAL.
             05  ANO-ATUAL          PIC 9(004).
             05  MES-ATUAL          PIC 9(002).
             05  DIA-ATUAL          PIC 9(002).
